{
    "bmp-b1-0.jpg": "I was working on schoolwork when thunder struck outside my room. I just knew it had to be close. I heard it strike again and thought it sounded closer yet. I quickly jumped up, grabbed my camera and a tripod, and headed out into the storm. I tried to find the right angles by moving my tripod around the neighborhood. It was about when my community had cars driving home from work, and I had three drivers yell out their windows, \" You are going to get yourself killed.\" I paused and evaluated the risk and figured that it wasn't very likely for me to be struck before the power lines and other architecture would be struck first. Still, I decided that if multiple people, strangers, were going out of their way to caution me, I should heed the council and find a different location. At the time, the house across from my own was vacant and had no occupants, but they did have a small, albeit dying, tree in their front yard. I proceeded to set up under that tree for a few minutes. The rain was starting to fall, and the lightning and thunderstorm were ceasing when I was fortunate enough to time the strike perfectly.  I didn't have any fancy light-sensing triggers then, so I used a little bit of long exposure to capture the strike with a little more leeway. I don't have swift reaction times, so I was listening to how often the thunder clapped and when the lightning was visible after that, maybe 200 attempts, I finally captured this beauty of a photograph that truly lit the sky in front of me up in a beautiful pink and purplish glow. I couldn't look through the captures immediately, so I kept trying for several minutes. Then the rain finally started to pick up the pace, so I folded my tripod as I walked back home. I then reviewed my photos and was giddy with the results.",
    "bmp-b1-1.jpg": "On our adventure home from Oregon, my dad wanted to drive through a Red Woods forest near the border of California. We wanted to see how the Red Woods compare to our favorite forest in central California, mostly Sequoias. Seeing that we camp all the time surrounded by Sequoias, we know many people who visit them mistake the sequoias for redwoods because they have red bark and rather red lumber that I have seen firsthand from naturally fallen sequoias in that forest. The first thing I noticed when we got into the Red Woods forest was that everything seemed to be covered in dust, like sure there were plenty of green ferns, which looked beautiful, and other green growth, but almost everything seemed to be coated with a cloud of dark dust, like ash. We immediately noticed that the Red Woods were much taller than the Sequoias but thinner in diameter. The sky was beautiful that day, with some patchy clouds overhead. We took a small hike on the trails leading to a seemingly famous river because many families were swimming there. This area did feel like we were in a Star Wars movie, and there could be hover bikes zooming past us at any moment. It was indeed a magical place.",
    "bmp-b1-2.jpg": "My parents sometimes plan very cool vacations for our family, and my first adventure to Oregon was no exception. My mom has a friend who retired and moved to Grants Pass, Oregon, and she wanted us to head up there and visit for a week. Although none of us were looking forward to the 10+ hour drive, we knew there would be many photo opportunities. I was ecstatic to photograph the Pacific North West or at least what we could see. I had a Lumix camera at the time that had a Leica lens built in, and I just loved the color recreation it produced with every image. I took well over five thousand photos during that week's trip. Without exception, my favorite one I found looking through my camera roll was this photograph my father captured of my brother and me overlooking a volcanic river known as the Rogue River.  This was a downstream section; we witnessed a few paddle boats go down over this section while we watched from the shoreline. I've never been white water rafting before, but it made me want to try it someday. It's funny how often some of the favorite photos you see are the ones those closest to you capture for you. It encourages me to capture fleeting moments of those around me because photography is an effort to preserve beautiful memories you have lived out.",
    "bmp-b1-3.jpg": "Oh, to look to the stars, the cosmos, the infinite abyss in wonder and awe. I fell in love with astrophotography as soon as I bought my first dedicated camera. I wanted to capture the beauty of the night sky. I had upgraded to my first Canon camera a few months before begging my mother to go on another night drive out to a dark sky location that wasn't marked on a map. The destination was Red Rock Canyon, California, about 2 hours away from home. My first adventure out to this site was enjoyable. We were not the only cars present when we arrived and what I was not expecting was how much the cars driving by on the freeway in the middle of the night would illuminate the rock formation so much. I had an idea on the spot to use the car headlights to illuminate the scene's foreground. I also had a bright flashlight with me, so I said mom, let's pose in front of the scenery.  I liked how it turned out, so I entered this photo into the local fair, and it was the first photo that won an award after entering pictures for a couple of years. It also didn't just win any prize, it won the CEO of the fair award, which meant it got a giant ribbon because only one of those is awarded each year the local fair is held. I captioned it initially, \"Mars to Earth. Do you Copy?\" With that win, I realized the titles mean just as much as the photographs themselves. I now use clever titles every year I enter, just in case I ever get the opportunity to win another prestigious award for my photography.",
    "bmp-b1-4.jpg": "I was headed up to a good friend's house to work on our R&D software projects, and he let me know the hills were green from the recent rain and suggested I bring my camera. This friend is one of the most creative people I know, with pretty much any medium, music, art, photography, you name it, he is good with it. I took his word and packed probably too much photography gear. The first thing I set up was my primary camera on a tripod with move-shoot-move timelapse equipment to rotate around, capturing the sunset through what was, at the time, a rather gloomy day. We both agreed that probably nothing would develop from this timelapse. Still, as we were wrapping up our day developing our software project and the sun was just about to set, we walked outside and witnessed a beautiful sunset dipping just between the clouds, the valleys, and the mountain ridgeline. It was spectacular, so with the sun setting, I grabbed my camera, reviewed the photos, and was amazed at what it captured in a purely autonomous fashion. It shows that you never know what you might catch until you try it yourself.  ",
    "bmp-b1-5.jpg": "My dad had the pleasure of being a campsite host in our favorite forest for the first time, which meant we could camp in a trailer instead of a tent. I love tent camping, but trying something a little nicer for a change was extraordinary. I always bring my photography gear when I go camping with my family, and this time, I knew the Milky Way would be visible in the early night sky, so I grabbed my camera and tripod and pointed where my phone said the Milky Way was. First, I captured a dark image of just the treeline. Then, I took five paces back toward the trailer and caught one of the many beautiful Milky Way photos from this location. I had no idea there would be a bowl-shaped opening that perfectly framed the gorgeous Milky Way in the night sky. I had a bit of luck because the moon was above the tree line and helped illuminate the trees nicely. I originally developed the photo on my iPad and showed the park chief the next day, and he was speechless at how well it turned out. He immediately realized I could capture this forest's beauty very well and asked if he could use the image in his reports. I figured I didn't need to be so exclusive because this was always a hobby, after all, so I said sure thing and let him access several of my other photography from the forest too. It was nice being recognized by someone outside of my family, and It made me realize that a bit of kindness goes a long way.",
    "bmp-b1-6.jpg": "The warmth of an open fire underneath the night sky. You have cozied in layers of jackets with the excellent idea of S'mores soon to be roasted to that perfect golden crisp. Camping has always been a favorite family pastime in our household. Surrounding oneself in the lush wilderness and fresh air is one of the best ways to reflect on where you are and how far you have come. When the night falls in a forest of trees, you cannot rely on the industrialization of civilization to provide you with safety throughout the night. A simple strategy has always been that of a campfire. It provides the warmth and the alertness needed to survive the darkness. Humanity has been using fire to this end for all time. There is something so beautiful and so relatable about being near a campfire. One can feel completely at home even being miles and miles away from the house. Fire is a reaction to the fuel of its blaze. It is constantly in flux and so beautiful to watch in person. I was glad to capture a fleeting moment of its beauty to preserve forever.  ",
    "bmp-b1-7.jpg": "Part of photographing the cosmos makes you want to capture more detailed images akin to the ones shared by NASA. I tried buying my telescope and astro imaging equipment but wasn't entirely happy with what my telescopes could record. I thought that not every scientist that captures beautiful imagery uses a telescope directly. So I did some googling to find out how I could remotely operate a telescope and quickly found a service that does just that. They had several different telescopes that cost varying amounts to rent across several observatory locations worldwide. This meant two things. First, I could remotely capture detailed images of various astronomy subjects, and second, I could operate a telescope in Australia during the daytime in the states. I reserved my time for an imaging class telescope in Australia and checked their database for visible subjects in the southern hemisphere. One preview caught my eye, Lagoon Nebula. This nebula looked stunning. I captured all the necessary images in each color channel to render a color image. This meant that, unlike a digital camera that captures color in one shot, I had to shoot four different black-and-white photos through a different color filter that only lets that color through to the sensor. So I captured red, green, blue, and luminance images and used advanced astronomy software to align, stitch, and develop the raw photos I captured remotely during my reserved telescope rental. Creating these images took much more work than expected, but the results are stunning. This also greatly expanded my understanding of how light works with my cameras. It was a wonderful experience to learn this level of the astronomy industry.",
    "bmp-b1-8.jpg": "After shooting many images using a single all-in-one lens that did everything from very wide to very zoomed focal lengths, I decided I wanted to get a better lens for close-up subjects. I focused on getting a lens with a large aperture of 2.8 or greater and some glass that didn't introduce bad chromatic aberration or other artifacts. This led me to a few options, and when the one I picked arrived in the mail just after the rain had fallen, I jumped at the opportunity to test the lens out on raindrops in the backyard foliage. I was amazed at how sharp the images were and the incredible depth of field the new lens produced. This lens would change everything in my photography, from portraits to close-up shots. It was amazing to me how just switching to a better lens can have such a drastic impact on the quality of the images produced. You can almost feel the textures in this image. It made my rainy day an absolute joy to experience. After this, I changed what kind of lenses I would use beyond macro photos. I eventually upgraded my telephoto lens too.",
    "bmp-b1-9.jpg": "My family went hiking the trails we had been on countless times before, but this was the first time our family remembered the path being covered in a dense fog. I immediately fell in love with how foggy the forest looked and probably took nearly 3,000 photos just that day alone. We hiked from one campground to another, enjoying every moment of it. Birds were chirping behind the veil of fog. Logs and trees were poking out in interesting fashions like in a scary movie. Together we captured some beautiful memories on that hike. When we returned to our campground towards the end of the day, we noticed this fascinating geometrical fungus growing out of the ground. It was about the size of a baseball and looked like something from another planet. It was something none of us recognized outside of knowing it was some form of fungus. I got down-level with the subject and photographed it with a shallow depth of field to give it an increased pop from the background. It didn't need much to stand out because it contrasted naturally with the ground around it. The fungus was an absolute treat to the close of a beautiful day with my family.",
    "bmp-b1-10.jpg": "I captured some stunning forest pictures at the beginning of the misty mountain hike with my family. It is akin to something out of a storybook where the lines between reality and fairytales are blurred, and you never know what may happen next. Driving up the dirt mountain roads was also nerve-racking for my father because the fog was so dense that it was as if we hit the car against the clouds. While I felt it was magical driving through the clouds, driving in dense cloud coverage on a winding mountain road would be very stressful. I was glad to have more than one foggy day and capture the beauty of a densely packed, misty forest. The hike was full of almost wonderland-type feelings where every turn of the trail brought new experiences. There was a natural mood to these images that could not be faked. There was no doubt about it. The forest was a breadth of mystery and intrigue.",
    "bmp-b1-11.jpg": "We needed more than one trip to Oregon for our family. We wanted to experience even more of its beauty, so with a new invite to our friends in Grants Pass, we quickly made plans to have another fantastic adventure in the Pacific North West. On our drive up, I told my dad I wanted to see the Oregon coast and the beautiful cliffs of this region. It was 2 hours before the golden hour, and we were finishing dinner and preparing for the final push into Grants Pass when I reminded my father that I wanted to see the coastline. Reluctantly, he went forward with the detour to a simple \"park\" on the southern Oregon coast with a trail described as easy. It was the same park with a breathtaking view of Arch Rock, and we arrived just in time for some gorgeous golden-hour photography. I captured many beautiful pictures from the short loop trail that paved the way. It was a small area overall, but it had some breathtaking views of the Arch Rock and this cove that I immediately fell in love with. I love how the cove engulfed the last remaining rays of sunshine for the day and was framed naturally by the shape of the cove and the top of the tree in front of me. ",
    "bmp-b1-12.jpg": "Part of our second trip to Oregon was our friend's generosity in being phenomenal tour guides of some beautiful scenes in their newfound home state. They drove us through some of the more volcanic areas of Oregon, almost following the path of the Rogue River. We went nearly all day when we finally got to the farthest point of our adventure, Crater Lake, Oregon. This is a national park that I had seen some astrophotography of in the past, so I wanted to be at the park after dark to capture my Milky Way photograph. However, when we got to Oregon, we rechecked the weather report, and it was evident that the night sky conditions were going to be terrible. So I accepted defeat with astro and quickly adjusted my focus to capturing the day's beauty. Upon arriving at Crater Lake, my first expression was pure shock. It was massive! It was bigger than I could have ever imagined. I knew trying to capture its scale was going to be a difficult task. Even with my wide-angle lens, I couldn't contain everything in a single photo. I took several panoramas and tried various composures. What I liked the best was the clever use of foreground trees, creating an almost wrapping frame around the crater's immense scale. I took some telephoto images, too, and could zoom in and see the massive boats so small that even the people looked like dots. At some point, everyone experiences the feeling of being small and insignificant compared to the wonders of our world. However, everyone can contribute to society for the better, no matter how small; every piece helps!",
    "bmp-b1-13.jpg": "The wise old owl of the Oregon Zoo. I have always liked birds of prey, they were my favorite type of animal in high school, and I had a long-time dream of photographing one of these beautiful creatures in the wild. I still have yet to witness them in the wild, but I knew that the Oregon zoos cared for several ambassador birds of prey, so part of the plans while we were in Portland, Oregon, was to visit their zoo. I still would love to see some of these birds in the wild, but at this time, I was content with at least seeing them at zoos. We got checked in and were walking around the zoo when I noticed that they were going to have a bird flight demonstration, so my family found a nice spot to sit and photograph the birds in flight. I learned quickly that birds of prey, even owls that fly slower, still fly fast and are challenging to capture mid-flight. After the flight show, they had the birds at the front on perches and let us photograph them up close. So I took hundreds of images and was amazed at how wonderful these birds looked up close. I freaked some people out with how many pictures my camera took, but capturing an image like this was worth it. Most times, it makes more sense to catch a few and enjoy some time away from the camera's viewfinder, experiencing the sights firsthand. Part of a good adventure is being present and enjoying it personally, not just behind a lens. You learn this kind of care after times like this and take these lessons with you on your next adventures.",
    "bmp-b1-14.jpg": "What even is a Reflection Nebula, I thought after spending several hundred dollars trying to get enough images to develop this nebula. Let's rewind a bit. I picked another astronomy subject to photograph using the telescope rental service because the preview looked incredible. I set up my reservation and grabbed the captured images the following day. When I put the photos into my astronomy development software, I was appalled by how terrible the results looked. I quickly asked the community of remote telescope operators what I needed to do better and why the images seemed so wrong. They were quick to provide guidance, which was so helpful. They informed me that the photos I captured are of a reflection nebula which means that the light visible in the images is not directly received by the telescope but rather is a reflection of the light bouncing back to the telescope after thousands of miles away. They suggested I capture a few more images and try a different developing software with which they have had better success. I invested more into this image and spent several hours learning the new software until I was happy with the developed idea. This imagery pushed the limits of my understanding as a photographer and my budget. The result, though, is still beautiful to me. Even in the darkness of space, light finds a way! ",
    "bmp-b1-15.jpg": "Drones have advanced a lot in the last ten years or so. They evolved from toys to skillful photography equipment that enables us to see things beyond our grounded nature. I got permission from our state forest to fly my drone for hobby photography, so I occasionally take to the sky far above the trees and zoom around, gettings some breathtaking views from above. This photo was captured before a wildfire swept through the whole forest. It was one of the last times I saw the forest this green, and it is a moment I hold closely because I know someday the forest will be lush with green vibrancy. Wildfires are not only natural, but they also help the forest grow more healthy. Although beautiful, this image shows how much overgrowth can accumulate without wildfires. As heart-wrenching as a wildfire is through your favorite woods, knowing it will heal and grow back ever stronger is such a warming feeling. It gives you a sense of comfort that our children and grandchildren will someday see a beautiful forest again. ",
    "bmp-b1-16.jpg": "My introduction to astrophotography started with a glorified point-and-shoot camera with a wide-aperture Leica lens permanently attached to it. I invested money in my first move-shoot-move timelapse slider and motor. Next, I checked the weather forecast for the closest dark sky location I could find, as I was still in college. I asked my mom if she would go with me, and she ultimately decided to go because it was something we could enjoy together. We drove through a canyon road until we got halfway to our desert location. When we arrived where I wanted to capture it, we were surprised; construction lights lit the area ablaze and flooded the night sky with light pollution. I was devastated after driving that far, only to realize I wouldn't be able to capture the Milky Way. My mom suggested we keep going on the road a little further, and sure enough, there was a ridge line and then a dirt road that allowed us to get far enough away from the light pollution of the cars driving down the road. The ridge also blocked out almost every piece of the construction light pollution. I set up the slider and started a time-lapse. My mother and I sat inside the car and watched a movie on my phone while we waited for the time-lapse to finish. I didn't realize just how short of a timelapse you get even when shooting for more than 4 hours. Still, the single images were breathtaking, even on the camera's screen. Later after reviewing the photos, I realized that 4 feet of motion didn't change much for the scene I shot, so I used every one of the frames to create a star trail image of the Milky Way. I had never seen so much motion in a single shot, and I knew from previous star trail images that they don't typically have that many visible stars in the frame. So, at last, my astrophotography passion was born. ",
    "bmp-b1-17.jpg": "A river runs through this heart. My father has always been a fisherman. I greatly appreciated how skillful he was with a fishing pole in his hand. The rushing river in front of him roared with energy. My dad sat there calmly, casting every few seconds. It doesn't take long for him to reel in a catch. He always did this as a sport, releasing almost everything he caught back into the river from where it came. I tried to learn to fish but couldn't quite get the hang of it and being deathly allergic to fish, I decided to retire my fishing pole in favor of a camera. Even if I didn't fish myself, I would have a great time photographing the beautifully harmonic scenery of my family on the river. I am thankful my dad loves to go places like this every summer. Being with your family in such a peaceful place is a purely magical feeling!",
    "bmp-b1-18.jpg": "As with all good seasons, so does camping come to an end. We were heading down the mountain for the last time this year, and we noticed a change in the shade of colors the leaves of the forest carried. They were abrupt with yellows and oranges. We knew that fall was among us. We don't see the change of colors much where we live, so stumbling across this change and noticing it for the first time was a sight to see. The leaves were a poetic end to a beautiful family adventure and an exciting announcement of the fall season ahead of us. I also loved how the regular forest trees towered above the fall foliage, almost like they told us to keep our heads up as this time would pass and be ready for the following year. ",
    "bmp-b1-19.jpg": "The pillars of the Eagle Nebula were another dream capture of mine. NASA released a stunning image of the three pillars in the Eagle Nebula, and I knew I wanted to capture that night sky area. I set up another reservation and programmed it to capture the necessary raw images. I awoke the following day and had my captures readily available. I quickly threw them into my astronomy software and was surprised at how far away the pillars were in the images. I looked for other available telescopes and had the realization that the pillars were just too far away for any telescope that I had access to would be capable of capturing. The resulting image is still one of my favorites, even if I could not grab the pillars with the detail I wanted. I realized that I might never be able to catch them so close, but I can appreciate what I was able to capture. Part of growing as a creative is understanding where your limits are and accepting that sometimes these limits are beyond your control. It is both humbling and comforting when you realize you're still doing the best work you're able to do. I was still content with what I was able to capture. ",
    "bmp-b1-20.jpg": "It started with a simple hike on a new path around the campsite. We got to the highest point of the trail after hiking for a few minutes, and It wasn't as hot as it had been the last few days. Hence, I suggested to my parents that we should hike the rest of the way to Redwoods Crossing, which was several miles uphill, but I thought to myself that with how pleasant the weather was, it would be a wonderful day to conduct the rest of the hike. My parents said they wanted to return to the trailer to gather their fishing poles and get supplies for the full-day hike. So I said I would hike alone up to the crossing. On my way, I was amazed at some of the stunning panoramic views. This leads me to capture this gem up to the crossing. When I got to the crossing, I had so much time on my hands and photographed the river that ran through the crossing while waiting for my parents to catch up. They caught up a little over an hour later and got to fish before we headed back to camp.",
    "bmp-b1-21.jpg": "I tried many times to capture a beautiful long-exposure photograph of this river, and It was always a challenge because there was almost always some form of breeze blowing through this mountain riverbed. I was fortunate to set up my tripod without my pan-tilt head, since I forgot it before hiking here. Getting down to this location involved a bit of balance because I was standing on a steep incline to the point I was leaning against it with about a 15 ft drop below me of more rocks and the river next to me. I didn't want to drop my camera, so I was being as careful as I could be setting up my excuse for a tripod. I imagined that traditional tripods, you know, the wooden ones you see in western movies and museums, probably didn't have a pan tilt head either, so I thought to myself as I was setting it up that it was very reminiscent of an \"old\" tripod that brought an almost nostalgic feeling to setting it up. So I attached my ND filter and set up the settings that I thought would work. Sure enough, this image was captured a couple of minor adjustments later, and I was amazed at how sharp it turned out. It was as if the motion of the breeze just stopped briefly as I captured this with my camera. I consider it one of the luckiest shots I captured. ",
    "bmp-b1-22.jpg": "I was offered the opportunity to travel to a winter wonderland for a week with some friends. I had never attended a winter camp before and had not been to too many lakes during winter. I was sporting a brand new, more miniature format camera that I wanted to push the limits of. I kept being drawn to this beautiful view at the lake's edge. The time passed into golden hour, and the clouds were simply heavenly. I loved the subtle tones of golden hour facing the opposite direction of the sun. The sun was slowly slipping into the twilight, and I set up a timelapse to capture the last amazing rays leading into darkness. This image was one of several hundred I captured in this in-camera timelapse, and I fell in love with the crystal blue water up against this mountain scenery, basking in the glow of the last rays of sun hitting the edges of the cloudy skies.",
    "bmp-b1-23.jpg": "A Pacific North West bucket list capture is seeing Arch rock at golden hour. We had been driving for several hours out of the day, and our journey continued on our path to Grants Pass, Oregon. I wanted to see some of the Oregon coastlines, so I asked my father to continue driving north, and we could cut through the mountains to get back to the road that leads into Grants Pass. So with some reluctance, we went to the closest PNW coastline park my app showed us, and we witnessed this beautiful scene firsthand. We also captured some good memories before driving through the forest in pitch darkness. We arrived in Grants Pass shortly after that.",
    "bmp-b1-24.jpg": "Some of the other captures from the misty mountains head-in-clouds hiking adventure included several macro shots where I aimed to capture the textures of the environment close to the trail. We walked past several exciting fungi growing out from the sides of giant trees. We also got to enjoy such a densely packed, foggy mountain trail. My brother was there photographing his experience, as was I. We had an absolute blast witnessing the familiar forest we grew up visiting each summer in this new condition. It's so interesting how something as simple as the weather can have such a lasting impact on the overall adventure. I walked past a fallen log covered in Moss and noticed my brother had fallen behind. So I hiked back and saw what caught his eye. It was the lush green moss growing on this ancient tree that had likely fallen a long time ago. I set up my camera with impressive composure and used a very narrow depth of field to capture this almost tilt-shift feeling image of the moss against the fallen sequoia log.  ",
    "bmp-b1-25.jpg": "After the first successful trip to Red Rock Canyon a few years prior, I was eager to return to the desert to capture more astrophotography. I knew that with it being May that it was prime Milky Way season. I coordinated with my mother on the best weekend to go, and we checked the Lunar calendar and the weather and settled on this weekend. Friday rolled around, and my mother suggested we find a hotel so we don't have to drive all night. We called a hotel in Lone Pine, CA, asked what the in-person sky conditions were, and made our reservation. We packed up our gear and started driving in my car in the middle of the desert. I went to the Red Rock Canyon site, and we captured a few more photos before we continued pushing the rest of the way to Lone Pine. We got checked into our hotel room, got permission for a late checkout the next day, and started moving in the night sky's darkness down Whitney Portal Road to the turn-off I had on my GPS. We drove along on a long windy dirt road and struggled to find the proper composure. Finally, I found a small hill next to the road, took a single photo, and saw the snow-capped mountains behind the hill, and the Milky Way wasn't entirely above the horizon yet. I set up a simple panning timelapse to run for 4 hours till about 1 am, and I returned to the car while that ran. I didn't get the speed quite right, so I didn't get the ideal timelapse I wanted, but I set up and captured a few individual frames of this mountain with the Milky Way at a complementary angle to the foreground. I like how this turned out with purple mountains, a breathtaking sky, and the warm desert tones in the foreground. I was happy we made this trip deep into the desert.  ",
    "bmp-b1-26.jpg": "My church group's leader invited me on a week-long trip to Hume Lake. I had never been, and I also had never been to a winter camp either, so I decided I would be glad to go. I took my camera with me and captured all sorts of beautiful moments, like this depth-of-field piece focusing on the most miniature snowflakes on a pile of snow at the edge of the lake. The clouds are rolling in the distance, and the feeling of a cool breeze on a snowy winter afternoon. ",
    "bmp-b1-27.jpg": "We were approaching the tail end of spring in our valley, and I wanted to see some California Poppy flowers while they were still visible. So we drove all around in search of just a single Poppy.  We drove for miles and miles on the side of a road with No Parking signs all along it until we arrived at this beautiful green and orange scenery of a massive field of Poppies. It is one of those images that indeed show the diverse biomes of this state. It was also poetic about how fleeting some moments I capture are.",
    "bmp-b1-28.jpg": "We were hiking along the river where we love to camp. My family always loves to fish the rainbow trout in this river. Instead, I prefer to try photographing the infinite angles this beautiful forest reveals to me as I adventure with my family. I used to fish with my family too, but being so deathly allergic to fish, I have found new joy in being the photographer and documenter of our hikes instead of fishing on them. This is one of the many waterfalls my dad has memorized in this area. My dad has the complete topography of this mountainside committed to memory and can recall and navigate through it instantly. It is also so much fun being up here with my father because he knows all the best places to have fun. I have captured thousands of photos of this area and still need help piecing together the geography of the images. I am so glad my dad has taken me camping up here every summer!",
    "bmp-b1-29.jpg": "When I was interviewing with my current employer, I requested time to keep my camping trip, and to my surprise, they allowed it. So I went with my parents to camp in the trailer again and decided I wanted to finally take my programmable light bar wand and use it under the night sky. With a few trials and the help of my mother clicking the shutter, I captured this unique abstract piece of the forest's edge under a cloudy night sky. I was glad the image turned out as well as it did, considering it was a rather old crowdfunding campaign product I had never used. It can do many more sophisticated pieces than simple abstract patterns, but I was glad to add a bit of abstraction to an otherwise peaceful night sky. It truly adds meaning to the term painting with light. ",
    "bmp-b1-30.jpg": "When I worked at my employer for a few months, I realized that I could afford my puppy, and I made arrangements to get my first dog which was my responsibility. I wanted an intelligent dog breed and found a local breeder who sold Miniature Australian Shepherds. I was able to bring home the joy of my life, Luma. She was so energetic as a puppy, and when she was old enough that I could let her into the backyard, I loved seeing her zoom around. She was so swift that my cameras could not keep her sharp sufficiently for the overcast days. She had just been playing in the nearby bushes, and I just so happened to catch her whip out from behind the bushes with something in her mouth. She was so quick that I didn't have time to process what I saw until I looked back through the images and saw the \"Luma: Dog of Peace\" appearance due to the branch of leaves hanging from her mouth. She was frozen in time, and I was so glad I was able to capture this fleeting memory. They grow up too fast! ",
    "bmp-b1-31.jpg": "About a year later, I was planning with my friends from church to make a dog-friendly trek out to the coast where Luma could have her first experience with her paws in the sand and the loud waves crashing in the distance. She honestly didn't seem all that impressed with the beach. Overall, she liked being outside and in a new place, but she was scared of the ocean water and did not like being close to where the waves crashed on the shore. She enjoyed staring out into the distance, and we had much fun lying in the sand. We found a nearby restaurant that had outdoor eating that was dog friendly. We ended the day by walking about ten paces back and forth along the beach and then started the drive home. Luma was well-behaved on this trip, and I think it was one of my favorite trips I got to go on with my friends. ",
    "bmp-b1-32.jpg": "My mother had informed me that we would have a Lunar eclipse again soon, and I had some new photography gear capable of tracking the moon. Although the equipment was still early beta, I was able to get set up in my front yard early one morning, and my neighbors were preparing to go to work and saw me pointing at the moon, and we had a brief moment to talk about the Lunar eclipse. I asked him if he wanted to see it from what my camera saw, and he did. I saw him smile in amazement at how much detail my camera could capture, and I was pleased because I didn't even develop the photos yet. Typically with astrophotography subjects, you capture several frames and stack them together in editing software to reduce noise that the sensor may have added during capture and to preserve more details shared across the images. I was glad to see surrounding stars in the image as I had not seen that in previous Lunar eclipse images, I captured. ",
    "bmp-b1-33.jpg": "My friend invited me to a summer church camp outing, and he was arriving late to camp. The group decided to take a night hike, so we all ventured out with flashlights. We stumbled across a cross silhouetted against the night sky, and I knew I had a brief opportunity to set up my tripod and camera and capture an image of the church members under the night sky. I got the settings set decently quickly, and I liked the motion from them moving slightly under the night sky. It was a rather magical gathering and moment under this cross on the country hillsides. It has some light pollution and a plane flying by, but overall I was thrilled with how it turned out. The people in the image also really liked the feeling captured in this image. You don't always have an infinite amount of time to grab a shot, and so knowing how to operate your camera entirely is a must for photos like this, where not only can you not see the buttons in front of you, but you only have a few seconds to start capturing it.",
    "bmp-b1-34.jpg": "We drove my grandmother to the coast to visit with a longtime friend who lived at the oast. While we were over there, I wanted to capture some new styles of images at the beach, and our friend offered to drive us over to some neat locations in Montano De Oro.  The whole time, we were not too optimistic that the weather would be very forgiving. On the drive over, we were stopped briefly on the side of the road where a panoramic view was visible, showing Morro Bay in its entirety. I used the foreground grasslands to add a small amount of depth to the scene. You can barely make out the three stacks in the distance due to the evening haze that had swept through the bay. I liked the calming tones in this image too. ",
    "bmp-b1-35.jpg": "Before the sun set below the horizon, we decided to hike some trails near the cove that all start at the top of the cliffs and wind all around the upper area. There was so much exciting vegetation and flowers. The warm tones of the setting sun complemented the lush greenery of the surrounding plants. The slight haze in the sky also resonated with the last few rays of the setting sun. ",
    "bmp-b1-36.jpg": "We arrived at a cove known as Spooner's Cove, with some breathtaking rock formations. It had many shear-dropping cliffs nearby too. Someone was far out on the rocky landscape that seemed to wind into the crashing waves. The sandy beach was covered in glowing red seaweed that fit so well into the warm colors of the setting sun. I also liked that the ocean seemed to crash to the right side against the cliff edge naturally. This was one of the most magical little coves I had seen. There were so many options for composure that I couldn't capture all of the ones I could think up before the sun dipped too far below the horizon. ",
    "bmp-b1-37.jpg": "This was Luma's first 4th of July party, and we had to light fireworks to celebrate our nation's independence. I had recently obtained a film camera and wanted to capture memories on a more traditional medium I had not tried in a long time. This camera was interesting because it could have automatic settings on everything except focus. Thankfully though, for being over 50 years old, it had a relatively decent visual aid to lock in focus quickly. The camera I tried was the Canon AE-1 Program, and I used a simple 50mm lens. I was impressed with the first set of films I had developed, and I received these scans almost a month after I captured them. I liked the style and feel of these images. My dog also did well and could be with the family for most of the firework show. Unfortunately, she got super thirsty, so before the show's end, my mom took her inside to get some fresh water and rest.  ",
    "bmp-b1-38.jpg": "I don't like artificially applying a Black and White filter to a digital image because I always feel it dishonors traditional black-and-white film. So, having my film camera capture memories, I had to try out a roll of black and white film. I used one roll around my house and fell in love with this moment of my dad sitting next to my dog, smiling at her. I captured a simple moment by just walking out of my room. Sometimes the everyday moments are the most precious in ways it's hard to explain. I don't know if my dog cheered my dad up from a difficult day of work or if he was glad to be accompanied by my dog as he was watching TV. I know that my dog has always enjoyed the company of us on the couch with her. She truly is an amiable dog.",
    "bmp-b1-39.jpg": "While finding my favorite camera film to use, I tried some Ektachrome color-positive films. I was capturing photos of my freshly groomed dog in my backyard. A few months later, I got the slides back from the closest film lab, and my dad got out my grandfather's old two-slide film projector that he used to use to show his boy scouts where he was planning to take them. Realizing just how cool using this antique slide projector was both because the grandfather I never had the opportunity to meet used to use it but also because it worked so well all these years later. Technologically it is pretty simple. It is a bright lamp that shines through a series of lenses that render a slide against the wall. Still, realizing I could use this family heirloom to enjoy some new photos I captured was so special.  ",
    "bmp-b1-40.jpg": "My uncle had been inviting me to the Pacific North West for quite some time since he had been working up there for over a year and kept telling me I needed to make it up there to him. My grandmother was still making relatively frequent visits to them then, so I asked her if she wouldn't mind if I tagged along some time with her. I got the time off approved with my work and started preparing for the week-long adventure. I let my uncle know I wanted to capture as many beautiful landscape pictures as I could, and so we both started thinking about great places to visit in the short time I could be there at the end of the year. We started the first day driving out to a lighthouse on Point Reyes, and while going through surprising dairy and cattle farms, there was a herd of elk feeding on the coastal grasslands. My uncle pulled over, and I said to pop the trunk. I needed to get my telephoto lens, and sure enough, as soon as I started looking through the lens, I saw this elk just staring straight at me in whimsical curiosity. I snapped a few shots and fell in love with the simple balance of this image—the pacific ocean off in the distance. I quickly hopped back in the car, and my family was surprised I was already done and asked, did you capture everything you wanted? I showed them this image, and we continued down the windy road to the next destination. ",
    "bmp-b1-41.jpg": "We arrived at the parking spot for the Lighthouse and noticed it was rather cold with high winds and a light sprinkle of rain as we got out of the car, so I bundled up with the not nearly enough jackets best I could and started hiking over to the lighthouse. The trail goes past a few neat destinations, such as an overlook of a massively long beach that seems endless. There were also several tall trees, a closed museum, and a lookout point leading down to the lighthouse. The lighthouse was closed to the public then, but that didn't stop me from snapping a photograph with my telephoto lens. I loved the different shades of water, bringing an excellent visualization of the difference in seafloor depth. This was indeed a particular lighthouse that was very well kept up. Lighthouses are not really operated much anymore, thanks to advancements in GPS and other navigational equipment today. Still, from a historical perspective, I like seeing them maintained even today. ",
    "bmp-b1-42.jpg": "I always have difficulty photographing wild birds of prey, but while visiting Point Reyes, I saw this hawk soaring over the cliff edge and knew I just had to try. I likely shot several hundred shots, and I liked this one the best. It could be more perfectly sharp, but it was strong enough for my liking. This hawk was zooming past me with great speed and intensity. I liked that all you see is the blurred Pacific Ocean in the distance with a hazing skyline. It is always beautiful seeing the animal kingdom pursuing its natural order. This bird, like many, must fight so hard for survival; without human intervention, they do just that repeatedly. The animal kingdom is rough, but its involvement with our world helps sustain the life around us in one way or another. There is a beautiful balance to seeing their kingdom revealed to us over time. ",
    "bmp-b1-43.jpg": "We started traveling towards the northern tip of Point Reyes, and the sun was quickly setting as we were venturing over to Dillion Beach. We were still amazed that some cattle farms were over on this side too. These farmhouses were grandfathered in so that even with Point Reyes becoming a nature preserve, these farmers could maintain ownership of their lands. It was indeed a beautiful sight to see that the cattle could live their best lives in green pastures and breathtaking oceanic views. If I were to be a farmer, I would love to have land like this.  ",
    "bmp-b1-44.jpg": "We were heading home from Dillon Beach, and I just happened to see this cow atop the green hillside, silhouetted against the cotton candy skies. This was during twilight, and thanks to my DSLR, it captured many details with such little light, even with a telephoto lens. This reminds me of the old Windows XP default desktop background with a more dramatic theme. These light cloud formations were magical, and I had a phenomenal first-day photographing Point Reyes.",
    "bmp-b1-45.jpg": "This is a beach my uncle was very fond of. He said that the first time he witnessed it, he drove down to the parking lot on the beach and walked out onto it, and it was just endless as far as you could see. From one side to the other. On our trip, though, we could appreciate it entirely from the southern end of it. It does feel incredibly endless. The waves crashing onto it looked like they were more than plentiful. I loved seeing just how vast this view was. ",
    "bmp-b1-46.jpg": "The sun had just set well into the clouds in the distance at Dillon Beach, but the sky was still aglow with the last remaining rays of sunshine. A paraglider was riding the previous few waves out just on the coastline. The deep blue water was that of a jewel color. Dogs were running and playing fetch on the shore with their owner. The wind was blowing full force, so I had to be quick because I was starting to freeze. I was so frigid. On the way home, we stopped at the gift shop, and I picked up a Dillon Beach beanie.  ",
    "bmp-b1-47.jpg": "The next day we decided to go to the great city of San Francisco, and on the way over, my uncle said he knew the best place to photograph the Golden Gate Bridge, so I said \"Let's go then!\" He took us winding everywhere around the northern side through tunnels and around corners I had never been to, but we avoided so much traffic. We arrived at an exciting village that my uncle said was a rental property, and you can rent out much like an Airbnb, and I thought to myself they must be costly to rent these out. He took us around one last corner, and we got out of the car and saw this breathtaking view of the Golden Gate Bridge that was far more beautiful than what I had ever captured of it before. It was so helpful to have someone local show me around this area because there are some truly magical sights to behold. ",
    "bmp-b1-48.jpg": "We started the drive up towards some old batteries and bunkers that have long been abandoned on the northern side of the San Francisco Golden Gate Bridge that I just learned was over here. These bunkers were massive, supporting some of the largest cannons. From reading some signs, they were built around 160 years ago in preparation for a naval attack from outside forces that never happened during the Civil War. We kept driving around and reached the top of the hills overlooking the Golden Gate Bridge. The water was an interestingly emerald color, too, at this time. You can even make out Alcatraz in the distance. I was still happy to see this sight for such a rather gloomy day. ",
    "bmp-b1-49.jpg": "My uncle whipped us around a few neighborhood blocks and said get your camera ready. The museum of art will be on your right momentarily. So I quickly rolled the window down and started capturing as many images as I could because I knew I had little time. I likely shot off about 100 or so photos in a matter of seconds and was hopeful I captured one good one, and as we got to the stop light, I thought to myself, I felt like such a tourist doing that funnily enough. I did catch some decent shots, but I think sometimes it is better to slow down and enjoy things from time to time, and while there was zero chance of parking, I guess I could have tried to capture a few fewer shots and enjoyed it with my own eyes.  Maybe next time.  ",
    "bmp-b1-50.jpg": "After driving all around San Francisco, my uncle drove us up to Twin Peaks, which had a stunning panoramic view of the city. I decided to capture a few stills and then set up my photography gear to capture a massive 500 Megapixel panorama of the city just after twilight. So I set up my equipment. Unfortunately, the software wasn't working, so I manually operated it and captured over 700 pictures, each being a narrow view of the city. I spent several hours that evening letting my computer stitch together each image into a beautiful panorama. It was so large that I had difficulty figuring out how to present it. Thankfully I found a website designed for just this kind of thing, so I used it to share the panorama in all its beauty. Still, even a single frame of that panorama looks beautiful, like this shot of the Golden Gate Bridge in the distance. ",
    "bmp-b1-51.jpg": "We also drove through a forest view to meet up with a river known as the Russian River. We stopped and walked the dog on the riverbed deep in the mountains. We continued following the river to the ocean and captured a few photos of the setting sun glistening in the Pacific Ocean with the last few rays of light. It was a rather gloomy day, but the warm and masked glow of the sun made it simply beautiful. The sun finds a way to illuminate our world, and I am very thankful. A bird was soaring in the sky too. We then proceeded to venture out to a place known as Goat Rock. It got its name because it used to have a somewhat invasive population of goats that lived on top of this rock with sheer cliff sides. The goats were eradicated a long time ago, but it was still really cool learning about the story of this rock formation right at the ocean's edge. ",
    "bmp-b1-52.jpg": "The forest we would always visit every summer was closed for over a year as they cleared out the many dangerous burned trees from the previous season of wildfires. We wanted to see a river somewhere, and I did some googling and found a \"waterfall\" in the southern mountains that we decided to visit since it was a dog-friendly area. My brother and his family drove over too. We drove through roads we hadn't gone in a very long time. We arrived at the trailhead and weren't impressed, but the dogs were eager to hit the trail. I brought too much photography gear, but that didn't stop me from having my mother capture a few photos of Luma and me. This was one of my dog's first hiking trails with us, and she loved it. We started hiking back and saw this smaller waterfall down a sheer drop-off, and we carefully found a safe path down to this little pool. I wanted pictures of us, so I was glad my mother was ready to capture the shot. ",
    "bmp-b1-53.jpg": "The rest of that southern California adventure continued from the mountains to the coast, where we walked the dogs out on a pier and then headed over to a dog-friendly beach. This dog beach was different from most in that it had a massive off-leash section. I had already been working on Luma's recall, so I trusted that training would aid in this experience for her. I looked her in the eyes, and I unclipped her leash. I let her venture out, and she got acquainted with the many other playful dogs on the beach. She had a blast and would venture out maybe 10 yards, and when I called her, she came right back to my side. We walked to the beach's end, and there was this fantastic rock formation. I grabbed my dog, and my mom quickly snapped this photo of us. A couple of attempts later, I was happy with this one. We kept walking back along the beach, and on the walk back, a trio of other similarly sized dogs got Luma to play with them. I have not seen Luma play with other dogs like this ever since, so it was nice to know that, given the right circumstances, she likes to play with other dogs.",
    "bmp-b1-54.jpg": "My church has a beautiful discipleship of their flock, and my brother informed me that he was on a church baseball team, and they were playing that evening. I was ecstatic to hear that my brother was playing some sports again, and I was so glad to be able to see them play. I packed my telephoto and got lovely photos of the church members playing ball. This was one of the action shots from the setting sun evening that I got of my brother just after he made contact with the ball. What I like about this shot is just how sharp everything is. It froze this moment when his arm's details were captured well. Shortly after this shot, my brother ran to first base, and the game continued. It's so cool seeing my church brothers coordinating and playing events like this.",
    "bmp-b1-55.jpg": "The mountains opened up this summer, so we set out with my parents to camp. I recently bought a Starlink satellite dish to test in the mountains with zero infrastructure outside running water. We were hiking down to the main campground parking area, and I was with my dog admiring and photographing the mountain scene just through the small break in the trees. Earlier, I had handed my other camera to my father and wanted him to snap some photos of my dog and me. I never expected how much I would love the photos my father captured of us. This image establishes the tone visiting this area has with me. These tones of openness, fresh air, and jaw-dropping views of the mountains. It is one of my favorite photos that my cameras have ever captured. I am so thankful for my father preserving this memory. ",
    "bmp-b1-56.jpg": "We drove over to a place known as Hidden Falls. We enjoyed the bridge and then started to hike down the very steep trail to the Hidden Falls. As my dog and I was photographing the falls in the riverbed, my dog was staring right up at me, and I could capture this photo with the sun beating down on her face. Her eyes still radiated with the beautiful ghostly blue aura. I like photographing the waterbed, but being able to photograph my dog as the subject matter of the riverbed stood out to me as something special. My dog was also named after the concept of luminosity, which makes me appreciate this shot with her face glowing so much even more. ",
    "bmp-b1-57.jpg": "These are the impeccable signs of the campgrounds we have always greatly enjoyed visiting. This is remarkable because the new sign looks great, and you can see the original sign on the fallen sequoia log in the background. This campground has been the home base my family has ventured out in all directions over the 30+ years we have been visiting this forest. My father fell in love with this area as a child himself, and I always love going back with him repeatedly. ",
    "bmp-b1-58.jpg": "I had wanted to visit a place known as Devil's Postpile National Park for some time since my brother and I had photos taken of us there as kids. So we made plans to make a summer vacation over to the Eastern Sierras. We found a hotel we could use as a home base in Bishop, CA. I also knew that the astro conditions would be excellent while we were there, so the first night arriving, I got access to a guide on where to find rock artwork, more commonly called Petroglyphs, carved in the valley such a long, long time ago. After hiking for a long time at such a steep incline and becoming rather sick from the over-exertion of carrying a 40lb camera bag, we decided to visit a different location, Table Rock. I quickly captured a few photographs with the last remaining light when we arrived just about twilight on an extremely rough road for my old Corolla. I then decided to wait for just after dark when the Milky  Way was at a prime angle for photographing over the Petroglyphs. I used a lantern with a few layers of tissue paper to illuminate Table Rock. The sizeable warm glow in the distance is the city of Bishop. I loved how much detail even a wide-angle astrophotography image can record. It brought me back to my roots from some of my first astrophotography attempts before trackers and telescopes brought so much complication to my process. Sometimes keeping it simple is the best option. ",
    "bmp-b1-59.jpg": "When we started the drive to Devil's Postpile, we didn't realize that they don't let any cars into the park after 7 am except for campers, so we drove back to the Mammoth ski resort, found some lucky parking and took the shuttle buses, which to our surprise allowed muzzled dogs to board. We arrived at our destination and immediately started hiking the trails. We could soon witness this beautiful river near a mountainous valley with lush green grass and trees. I was overjoyed with just how scenic the views were. However, I didn't realize that the best ideas were yet to come. ",
    "bmp-b1-60.jpg": "My dog and I slowly made our way up the steep \"stairwell\" on the trail up to Devil's Postpile. I was so happy when I saw the top of it. When my brother and I were still just young boys, my parents took us here, and there was a picture of my brother and me standing where I was standing here. I was overjoyed to be standing here with my dog all these years later. It was also incredibly windy today, so my dad, who captured this image, didn't want to get close. He has anxiety with heights, so I didn't ask him to do anything he felt unsafe doing. However, he was glad to take these from afar thanks to a little bit of telephoto my camera lens had.",
    "bmp-b1-61.jpg": "When we started the trail, it warned us to pack water, and I thought my three bottles of water would have been enough, but I was wrong. We kept hiking down and down the trail to see what is known as Rainbow Falls. My memory must have been remembering a very different waterfall because when we got to the lookout point, my jaw dropped at how beautiful and massive this waterfall indeed was. I quickly captured several images and a few videos, but so many people were there. I was exhausted from our hike, but my dad insisted we go down another steep stairwell to the waterfall's base. I reluctantly followed him with my legs shaking so badly they should have just been made of Jell-O. I set up my tripod for a long-exposure photograph of this beautiful waterfall. After several hundred photos, I packed up, climbed, and hiked to the bus stop. I didn't realize how tiring this trail would be and was very concerned we wouldn't be able to make it to the bus stop in time for the last ride out of the park. If you can believe this, my brother called us while on the trail and said encouraging words that inspired me to push through and hike with a new breath of wind. We made it to the bus stop, got some water, and had a great conversation with hikers from the Pacific Crest Trail about astrophotography on the way to our car. It was a delightful end to a rather exhausting hike through the woods. ",
    "bmp-b1-62.jpg": "As soon as we got back home from the Eastern Sierras, we got packed to go to the Western Sierras, where we love to camp. My brother and his wife were planning to camp there, too, at the same time, so we also got to go on a few hikes together. We hiked to the river early in the morning to a spot my family has often fished. As my brother cast one of his first lines into the riverbed, I was at the right place to photograph it. I was glad to be ready for this shot because there are a lot of good feelings leading up to the first cast. It was just the beginning of our hike, but it was already shaping into a great adventure. ",
    "bmp-b1-63.jpg": "We hiked down the river to another common place to cast a line into. This area is accessed by carefully traversing back and forth over very steep rock formations that are jagged and sharp. At the bottom of this wedge-shaped rock formation is a deep pool that is likely 15 feet deep or more. My clever dog got under a log to catch some much-needed shade in this area. The river flowed rapidly, and I used my iPhone to capture this long exposure image of the falls here. ",
    "bmp-b1-64.jpg": "One of my favorite things to do while camping is roasting marshmallows over a campfire. This evening was turning out nice after a long day on the trails. So I grabbed a couple of marshmallows and held the stick over the fire near the embers. I keep them a couple of inches away and keep rotating them. After a few minutes, they turn this excellent golden brown color. I try to keep this up for a while, and when I see the golden color darken more, I pull them away and slide them off the roasting stick onto a graham cracker and chocolate to create the most wonderful of desserts known commonly as a S'More. ",
    "bmp-b1-65.jpg": "While we were enjoying the last few hours at camp, my brother, his wife, and their dogs were hiking down the road together just before sunset, and I wanted to capture a moment of their family enjoying their time together. I was so glad my brother's family likes camping because I know how much my brother has always loved camping with us. I am delighted he will continue the camping traditions with his family now.",
    "bmp-b1-66.jpg": "We were trying to hike back up the trail to camp, and my dog and I were exhausted. I saw the end of the trail was approaching, so I encouraged my dog to keep going, we're almost there. We made it to the top of the trail and caught our breath on a log on the side of the road. After the rest of my family also got back from the hike, we started making preparations for dinner. My dog was looking at me concerned, having just eaten her dinner, so I walked her to the other side of the road, and she just plopped down and kept staring at me. She was done. She didn't know we would take the rest of the trip easy, but her eyes told me she didn't want to do it anymore. So we spent the rest of the journey at camp relaxing and enjoying the weather. After traveling all over the Sierras, this weekend was a welcome change to relax.",
    "bmp-b1-67.jpg": "My church has a great worship team that often leads us to sing new and exciting songs. I was asked to capture some photography of the worship team from the back of the sanctuary, and I was glad I caught this fantastic shot of praise being sung out. It is a simple photo, but you can feel the joy.",
    "bmp-b1-68.jpg": "We made one last trip to our favorite forest before the end of the season. We had wanted to see Hidden Falls this trip, so after a short drive to Hidden Falls and the expected hike down; we spent most of the time in this river pool. I wanted to capture a long exposure image with my DSLR this time, so I set up my tripod, and my dog was at my side while I captured this image of this large and peaceful riverbed. When the water level is high, the waterfall at the center is easily about 15 feet tall. Plenty of fish were in this pool, so my brother did quick work to start fishing it. My dad was still on the trail up on the left and gave my brother a hint, and not even 5 seconds after that, my brother hooked the fish, caught it, and released it as well. Part of the beauty of fly fishing is releasing the fish back when you do not need that fish to survive. It is what makes this type of fishing capable of being a good sport. ",
    "bmp-b1-69.jpg": "I have wanted to capture a Milky Way photo with a tent for a long time, so with my family requiring me to use my tent for this trip, I was glad to try this shot. For the last several years, I had just stayed in the trailer with my parents, but now, having to use the tent after so long made me realize how I liked to camp in my tent. My dog also did so well in the tent that I may use the tent again on the next trip. Leading up to this shot, I asked my dad if we could go where the foresters planted many new trees so I could photograph the Milky Way there. While I was capturing the large panorama, we heard a few twigs break, and knowing mountain lions could be nearby, we were cautious and ready to return to the truck quickly. We didn't bring nearly enough light to be safe, but we did have my dog, who started growling and barking into the void of night, so we knew she sensed something we didn't. We canceled the panorama, quickly and carefully loaded back into the truck, and drove back to camp. This was one of the times I think my dog Luma saved our lives. Being super anxious about that and still wanting to capture a nighttime photo, I set up my camera and remotely operated it from inside my tent. After hanging out with my dog and waiting for it to finish capturing the panorama for over an hour, I was tired enough to fall asleep. I slept well that evening, knowing my dog was keeping me safe. ",
    "bmp-b1-70.jpg": "One of the other shots from the panorama also caught my eye. It was just a comprehensive view of the countless stars and the Milky Way forming a triangle comprised of an arrangement with the tips of the trees and the starry night sky. It was a simple shot, but I liked how it aligned well. Sometimes when shooting hundreds of photos for various composites, a single photo can catch your eye as something special. It is always a good idea to look through the sometimes thousands of pictures and pick out some of your favorites. ",
    "bmp-b1-71.jpg": "I work from home as a Software Engineer daily, and my dog sometimes tries to get my attention in unique ways. She has a stairwell to get up on my bed at her will. She was lying next to me, just staring at me. I grabbed my phone and snapped this cute photo of her snout. When this picture appears as my computer's wallpaper, it truly feels larger than life. Her ghostly blue eyes tend to cast judgment on your soul. I am thankful because she loves me more than I can ever love her back. Dogs are the best pets.",
    "bmp-b1-72.jpg": "When camping with my uncle many years ago, he took me to the archery range and let me try his compound bow. I was surprisingly decent with his bow even though nothing was aligned, so I aimed at an invisible target 3 feet to the right of the actual real target and hit \"bull's eyes.\" My uncle was astonished when I told him where I was aiming and suggested I get my bow. I saved up and got a bow from our local archery shop and learned so much after that initial camping trip. I got some incredible pointers from Olympic archers at a fun tournament. I had just gotten some new arrows for my birthday and was ready to hit the range. We have a great range that is relatively local, with targets from 10 yards to 110 yards. I am still trying to perfect my 20-yard skillset, which is also a typical range for tournaments, so my mother captured this image before I released the arrow. We also like to shoot as a family, and I have gotten my grandmother into the sport.  I look forward to getting back out to the range soon. ",
    "bmp-b1-73.jpg": "We had been shooting at the range for some time, and the range was closing as it was after sunset. One of the other archers there with us wanted me to try a new arrow release. I thought I was tired after shooting a short tournament with my mom, but I tried it. After trying it out, he said it is yours if you will use it. I immediately thanked him and went to grab my arrows. I expected my accuracy to be low because accuracy is usually affected after you change anything with a compound bow. Surprisingly, I had a better shot pattern here than I had throughout most of the tournament with my mom. I was excited to try it out again next time we made it out of the range.  ",
    "bmp-b1-74.jpg": "My parents wanted to participate with some friends in a coastal bike ride. My grandmother and I wanted to tag along, cheering them on and enjoying the trip. After my parents hit the road taking their bikes to the halfway point, my grandmother and I decided to visit some nearby scenery. The first stop was Morro Bay, where we went on a small boat dock lookout. It was incredibly foggy so you couldn't see all of Morro Rock. I saw a few birds nearby and quickly took a photo with my camera. I loved catching some beautiful colors on the neck of the pigeon in front of me.  ",
    "bmp-b1-75.jpg": "At the halfway point, there was a dog-friendly park and beach. After walking around the park and waving my parents off for the bike ride back, my grandmother and I walked out onto the beach with Luma. She got to run around with us and have a generally great time. I loved seeing her this happy with us. Of course, my dog has always been delighted around both my grandmothers, but seeing that same energy at the beach led to some great photo opportunities.  ",
    "bmp-b1-76.jpg": "We wanted to drive to Montano De Oro to get photos with Luma. What we didn't expect was just how few of the places here were dog friendly. Since the beach was dog friendly, it didn't stop us from having a good time. We hiked out onto the rock formations in a previous photo I had captured. This time I could catch a picture of my dog looking at me inquisitively. My dog has many expressions, and she seemed to be thinking about what we would do next. After several attempts to capture a good photo of Luma, I was happy with this one. I also love how foggy morning clouds engulf the mountains in the distance. It almost doesn't even feel like California here.   ",
    "bmp-b1-77.jpg": "The last moment of our time at the coast for this trip was just after dark, and the city lights of Morro Bay were illuminating the cloudy night sky. I wanted to test the limits of my phone's cameras, so I used my pocket tripod to prop my phone up on a nearby bench and trigged the photo from my watch. I was rather impressed with the performance of this shot and how it even captured some details of my dog and me. Honestly, I have a difficult time standing still, about the same as my dog, and so I was impressed that even with the motion blur, I still liked this image. There were sea creatures just off the shore behind me, also moving around. After seeing this image, I realized that the cameras we now can carry in our pockets could directly rival those of dedicated camera systems. This encouraged me because the best camera is always the one you have on you. ",
    "bmp-b1-78.jpg": "My work offered to fly me across the country for an annual meeting where we could also participate in team-building events. I met the people I worked with in person for the first time, and it was delightful. I also captured photography using my iPhone since I didn't want to bring my DSLR on this work trip. I was amazed by the aerial image out the plane window just after taking off in Texas. There were a few clouds which added to the picture as well.",
    "bmp-b1-79.jpg": "I have always had fun on Halloween with my friends, and this year was no exception. I like to get my costume ahead of time and take some photos for my profile picture on social media. I obtained a sci-fi laser tag blaster that I got to play with my parents at home a few times. I also received a lightsaber that is very, very bright. The last piece of the ensemble was the sci-fi mask. Everything was delivered a few days before Halloween, so I had to capture a few photos with the remaining days before the holiday. I was happy that this image was such an impromptu idea. It truly feels like the tiki sci-fi fighter vibe I was going for. I still have this and will likely use it next Halloween. It was relatively simple but looks excellent from the sci-fi aspect. ",
    "bmp-b1-80.jpg": "As the fall season was nearing its end, we were out taking Christmas photos as a family, and I wanted to get some photos of Luma and me. We saw this fall leaves tree on the drive out to our first location and liked the photos from this location quite a bit. I had my mother operate the camera and capture a few images of Luma and me. After returning home, I developed my favorites and ordered prints for my mother's Christmas presents. When she opened them on Christmas, she was overjoyed with how they turned out. My grandmother and mother hung them that day. We still get comments about how great the photos look, and they are surprised that we took them ourselves. Photography runs in our family, and I look forward to teaching my kids about it someday.",
    "bmp-b1-81.jpg": "One of the places in California is up in the Sequoia National Forest. It is a place that I had seen on my dad's computer countless times. It was in several of my father's photos, so I knew I wanted to visit it someday. My father agreed to drive us up there on a snowy winter day. We checked the roads, and it wasn't looking too promising, but we decided to venture out anyway. When we got to the toll booth, the operator informed us that dogs were not allowed on the trails but were allowed in the common areas. We drove to the location of the old photographs, General Sherman Tree. Upon arriving, we noticed there was a No Dogs sign. Luma waited back at the entrance with my mother, and my father and I went in and walked around the snow-surrounded sequoias. It was indeed rather beautiful seeing this with the snow. Although I didn't get to bring Luma on the trail, I enjoyed seeing it with my own eyes and capturing a photograph of my father and me. This location was packed with tourists, so I don't plan to stop by here again anytime soon. That said, seeing the sequoias in winter splendor was a breathtaking view. I want to encourage everyone to get outside and realize their dreams. If there is a place you have always wanted to experience for yourself, the only one in your way is almost always yourself. You may not always capture the most beautiful photographs but will always hold onto the most beautiful memories.",
    "bmp-b2-1.jpg": "It was just after the rainy spring weather when Luma and I were getting antsy, anticipating what adventure awaited us next. I took Luma for a short walk and captured this breathtaking portrait of her with a reflective background of golden-hour cloud formations. I was pleased with this photo while walking back home. With spring, though, we decided to hike up to a local trail, and my mother captured this stunning photo of Luma and me on the green hills trail of Wind Wolves. I also caught the full moon in a single night for the first time, where both the light and dark sides of the moon were exposed correctly. All of these three photos kicked off a somewhat inspired photography season.",
    "bmp-b2-2.jpg": "It was just after the rainy spring weather when Luma and I were getting antsy, anticipating what adventure awaited us next. I took Luma for a short walk and captured this breathtaking portrait of her with a reflective background of golden-hour cloud formations. I was pleased with this photo while walking back home. With spring, though, we decided to hike up to a local trail, and my mother captured this stunning photo of Luma and me on the green hills trail of Wind Wolves. I also caught the full moon in a single night for the first time, where both the light and dark sides of the moon were exposed correctly. All of these three photos kicked off a somewhat inspired photography season.",
    "bmp-b2-3.jpg": "It was just after the rainy spring weather when Luma and I were getting antsy, anticipating what adventure awaited us next. I took Luma for a short walk and captured this breathtaking portrait of her with a reflective background of golden-hour cloud formations. I was pleased with this photo while walking back home. With spring, though, we decided to hike up to a local trail, and my mother captured this stunning photo of Luma and me on the green hills trail of Wind Wolves. I also caught the full moon in a single night for the first time, where both the light and dark sides of the moon were exposed correctly. All of these three photos kicked off a somewhat inspired photography season.",
    "bmp-b2-4.jpg": "Thankfully, we had some inkling of what the spring and summer may hold due to early family discussions about what we can do this summer. You see, my grandmother's birthday was approaching this spring, and my mother had the idea to make a trip to Catalina Island. There were many reasons for this, but the first was that we had heard that Parasailing was much fun out of Catalina Island. Seeing that we live within a few hours' drive to the departure area, we thought it would be a fun way to experience an Island before we traveled as a family to another island adventure we knew was approaching. The first thing we did was rent a couple of golf carts for our party, thanks to my uncles, and they drove us all around the island, including the first stop, a high vantage point lookout over the bay. After that, we decided to go for a walk over to the theater, and along the way, I got a picture of the boats and another photo of the beautiful theatre. The theatre was sadly closed to the public, but that didn't stop us from enjoying the scenery. On the way back to the shuttle boat, I captured another photo looking under a bench out toward the ocean past the bay with a few boats visible in the distance. It was a simple framing photo, but I also enjoyed seeing the potential photograph before capturing it.",
    "bmp-b2-5.jpg": "Thankfully, we had some inkling of what the spring and summer may hold due to early family discussions about what we can do this summer. You see, my grandmother's birthday was approaching this spring, and my mother had the idea to make a trip to Catalina Island. There were many reasons for this, but the first was that we had heard that Parasailing was much fun out of Catalina Island. Seeing that we live within a few hours' drive to the departure area, we thought it would be a fun way to experience an Island before we traveled as a family to another island adventure we knew was approaching. The first thing we did was rent a couple of golf carts for our party, thanks to my uncles, and they drove us all around the island, including the first stop, a high vantage point lookout over the bay. After that, we decided to go for a walk over to the theater, and along the way, I got a picture of the boats and another photo of the beautiful theatre. The theatre was sadly closed to the public, but that didn't stop us from enjoying the scenery. On the way back to the shuttle boat, I captured another photo looking under a bench out toward the ocean past the bay with a few boats visible in the distance. It was a simple framing photo, but I also enjoyed seeing the potential photograph before capturing it.",
    "bmp-b2-6.jpg": "Thankfully, we had some inkling of what the spring and summer may hold due to early family discussions about what we can do this summer. You see, my grandmother's birthday was approaching this spring, and my mother had the idea to make a trip to Catalina Island. There were many reasons for this, but the first was that we had heard that Parasailing was much fun out of Catalina Island. Seeing that we live within a few hours' drive to the departure area, we thought it would be a fun way to experience an Island before we traveled as a family to another island adventure we knew was approaching. The first thing we did was rent a couple of golf carts for our party, thanks to my uncles, and they drove us all around the island, including the first stop, a high vantage point lookout over the bay. After that, we decided to go for a walk over to the theater, and along the way, I got a picture of the boats and another photo of the beautiful theatre. The theatre was sadly closed to the public, but that didn't stop us from enjoying the scenery. On the way back to the shuttle boat, I captured another photo looking under a bench out toward the ocean past the bay with a few boats visible in the distance. It was a simple framing photo, but I also enjoyed seeing the potential photograph before capturing it.",
    "bmp-b2-7.jpg": "Thankfully, we had some inkling of what the spring and summer may hold due to early family discussions about what we can do this summer. You see, my grandmother's birthday was approaching this spring, and my mother had the idea to make a trip to Catalina Island. There were many reasons for this, but the first was that we had heard that Parasailing was much fun out of Catalina Island. Seeing that we live within a few hours' drive to the departure area, we thought it would be a fun way to experience an Island before we traveled as a family to another island adventure we knew was approaching. The first thing we did was rent a couple of golf carts for our party, thanks to my uncles, and they drove us all around the island, including the first stop, a high vantage point lookout over the bay. After that, we decided to go for a walk over to the theater, and along the way, I got a picture of the boats and another photo of the beautiful theatre. The theatre was sadly closed to the public, but that didn't stop us from enjoying the scenery. On the way back to the shuttle boat, I captured another photo looking under a bench out toward the ocean past the bay with a few boats visible in the distance. It was a simple framing photo, but I also enjoyed seeing the potential photograph before capturing it.",
    "bmp-b2-8.jpg": "My birthday fell on the weekend just before we departed for Hawaii. At first, I didn't feel like doing anything extra because I didn't want to burden my family, who were all excited about our trip the next week, so I spent the morning with my Dog, Luma, because I knew she would not be flying with us to the islands. Instead, she would have a great house sitter who cared for my fur baby. So I wanted some pictures to remember her while I was away for a few weeks. I also solved a new puzzle called the Anti-Gravity puzzle, which was so enjoyable. It used different toned whistles to decipher, which was clever. I took a victory photo with my dog and the puzzle in the backyard. These were some of the last pictures I would see of my dog until I returned home.",
    "bmp-b2-9.jpg": "My birthday fell on the weekend just before we departed for Hawaii. At first, I didn't feel like doing anything extra because I didn't want to burden my family, who were all excited about our trip the next week, so I spent the morning with my Dog, Luma, because I knew she would not be flying with us to the islands. Instead, she would have a great house sitter who cared for my fur baby. So I wanted some pictures to remember her while I was away for a few weeks. I also solved a new puzzle called the Anti-Gravity puzzle, which was so enjoyable. It used different toned whistles to decipher, which was clever. I took a victory photo with my dog and the puzzle in the backyard. These were some of the last pictures I would see of my dog until I returned home.",
    "bmp-b2-10.jpg": "My birthday fell on the weekend just before we departed for Hawaii. At first, I didn't feel like doing anything extra because I didn't want to burden my family, who were all excited about our trip the next week, so I spent the morning with my Dog, Luma, because I knew she would not be flying with us to the islands. Instead, she would have a great house sitter who cared for my fur baby. So I wanted some pictures to remember her while I was away for a few weeks. I also solved a new puzzle called the Anti-Gravity puzzle, which was so enjoyable. It used different toned whistles to decipher, which was clever. I took a victory photo with my dog and the puzzle in the backyard. These were some of the last pictures I would see of my dog until I returned home.",
    "bmp-b2-11.jpg": "Now, I don't necessarily fear heights or the ocean per se. Still, something is fascinating about being in an airplane for 6 hours, flying over nothing but seemingly endless blue seas viewable just beyond the few clouds now and then. I was probably only uneasy due to how many episodes of LOST my family watched when I was younger. I did find it to be rather beautiful to see, though, and I was thankful for the window seat, especially when we finally approached the airport in Hawaii. When we first saw land out the window, the shoreline looked so beautifully blue with almost teal and deep blue shades. The white sands seemed so inviting. We were ready to enjoy all this island, Oahu, had to offer.",
    "bmp-b2-12.jpg": "Now, I don't necessarily fear heights or the ocean per se. Still, something is fascinating about being in an airplane for 6 hours, flying over nothing but seemingly endless blue seas viewable just beyond the few clouds now and then. I was probably only uneasy due to how many episodes of LOST my family watched when I was younger. I did find it to be rather beautiful to see, though, and I was thankful for the window seat, especially when we finally approached the airport in Hawaii. When we first saw land out the window, the shoreline looked so beautifully blue with almost teal and deep blue shades. The white sands seemed so inviting. We were ready to enjoy all this island, Oahu, had to offer.",
    "bmp-b2-13.jpg": "After flying close to the shore, the pilot took us out over the ocean, where we got to see the Lizard Hat Island or, as it's known locally, Mokoli'i. You can see the land masses just under the ocean surface, which looks impeccable in this capture. After that, we flew through the Jurassic Valley, where many movies and TV shows were filmed in Oahu. It is part of Kualoa Ranch, and I will have more photos to share later in the book. What I loved about our helicopter flight was that the helicopter had a hula girl bobble figure on the instrumentation, and it would bounce around while I was sitting up front and bring a smile to my face when I saw it dancing. On the left of the valley was a beautiful mountain range, and on the right of the valley were land formations that were present in the Planet of the Apes movies. This valley is one of my favorite places I have had the pleasure of photographing.",
    "bmp-b2-14.jpg": "After flying close to the shore, the pilot took us out over the ocean, where we got to see the Lizard Hat Island or, as it's known locally, Mokoli'i. You can see the land masses just under the ocean surface, which looks impeccable in this capture. After that, we flew through the Jurassic Valley, where many movies and TV shows were filmed in Oahu. It is part of Kualoa Ranch, and I will have more photos to share later in the book. What I loved about our helicopter flight was that the helicopter had a hula girl bobble figure on the instrumentation, and it would bounce around while I was sitting up front and bring a smile to my face when I saw it dancing. On the left of the valley was a beautiful mountain range, and on the right of the valley were land formations that were present in the Planet of the Apes movies. This valley is one of my favorite places I have had the pleasure of photographing.",
    "bmp-b2-15.jpg": "When I heard we were going to Hawaii, I had a long-time bucket list idea of chartering a Helicopter to photograph something beautiful. So when I found out I could afford a helicopter tour in a place that seemed so incredibly beautiful in my mind, I jumped on the opportunity to pay for this so my mother and I could experience something new, both of us. I did much reading and learned that it is best to fly earlier in your trip than later so that you can learn the basic geography of the island for the rest of your time there. We went to a nearby beach the first day to get our feet in the sand. We enjoyed some packed lunches, and then my mother and I drove to the helicopter building and, shortly after, were airborne. We flew around Oahu essentially in a counterclockwise path, and the following few photos will go over some of my favorite pictures from this 1-hour flight. First, we have the Royal Hawaiian, a long-time favorite destination of our great family friend. I knew I had to photograph it even though the pilot was pointing out something else he thought was of high significance to us. I loved the pilot's narrative; he did a phenomenal job for our flight. Shortly after we saw The Royal Hawaiian, we saw Diamond Head, a large crater with a fascinating history that I encourage you to look up for yourself. After Diamond Head was a lovely cove that we were told was one of the best snorkeling spots on Oahu, but parking was nearly impossible. ",
    "bmp-b2-16.jpg": "When I heard we were going to Hawaii, I had a long-time bucket list idea of chartering a Helicopter to photograph something beautiful. So when I found out I could afford a helicopter tour in a place that seemed so incredibly beautiful in my mind, I jumped on the opportunity to pay for this so my mother and I could experience something new, both of us. I did much reading and learned that it is best to fly earlier in your trip than later so that you can learn the basic geography of the island for the rest of your time there. We went to a nearby beach the first day to get our feet in the sand. We enjoyed some packed lunches, and then my mother and I drove to the helicopter building and, shortly after, were airborne. We flew around Oahu essentially in a counterclockwise path, and the following few photos will go over some of my favorite pictures from this 1-hour flight. First, we have the Royal Hawaiian, a long-time favorite destination of our great family friend. I knew I had to photograph it even though the pilot was pointing out something else he thought was of high significance to us. I loved the pilot's narrative; he did a phenomenal job for our flight. Shortly after we saw The Royal Hawaiian, we saw Diamond Head, a large crater with a fascinating history that I encourage you to look up for yourself. After Diamond Head was a lovely cove that we were told was one of the best snorkeling spots on Oahu, but parking was nearly impossible. ",
    "bmp-b2-17.jpg": "When I heard we were going to Hawaii, I had a long-time bucket list idea of chartering a Helicopter to photograph something beautiful. So when I found out I could afford a helicopter tour in a place that seemed so incredibly beautiful in my mind, I jumped on the opportunity to pay for this so my mother and I could experience something new, both of us. I did much reading and learned that it is best to fly earlier in your trip than later so that you can learn the basic geography of the island for the rest of your time there. We went to a nearby beach the first day to get our feet in the sand. We enjoyed some packed lunches, and then my mother and I drove to the helicopter building and, shortly after, were airborne. We flew around Oahu essentially in a counterclockwise path, and the following few photos will go over some of my favorite pictures from this 1-hour flight. First, we have the Royal Hawaiian, a long-time favorite destination of our great family friend. I knew I had to photograph it even though the pilot was pointing out something else he thought was of high significance to us. I loved the pilot's narrative; he did a phenomenal job for our flight. Shortly after we saw The Royal Hawaiian, we saw Diamond Head, a large crater with a fascinating history that I encourage you to look up for yourself. After Diamond Head was a lovely cove that we were told was one of the best snorkeling spots on Oahu, but parking was nearly impossible. ",
    "bmp-b2-18.jpg": "Shortly after I captured the 3 photo panorama of that cove from a moving helicopter, we were told this next crater was a botanical garden with much different vegetation, if you can believe it. Zooming past that, we saw this lovely little lighthouse on a cliff edge that looked neat with the contrasting volcanic rock and blue watercolorsand circling that, we were able to see the Oahu-style sea-world equivalent that was featured in one of our family's favorite movies filmed on Oahu, 50 First Dates. Just past that was the house in the TV show Hawaii Five-O, and we also found out it was gifted to the Barack Obama family. ",
    "bmp-b2-19.jpg": "Shortly after I captured the 3 photo panorama of that cove from a moving helicopter, we were told this next crater was a botanical garden with much different vegetation, if you can believe it. Zooming past that, we saw this lovely little lighthouse on a cliff edge that looked neat with the contrasting volcanic rock and blue watercolorsand circling that, we were able to see the Oahu-style sea-world equivalent that was featured in one of our family's favorite movies filmed on Oahu, 50 First Dates. Just past that was the house in the TV show Hawaii Five-O, and we also found out it was gifted to the Barack Obama family. ",
    "bmp-b2-20.jpg": "Shortly after I captured the 3 photo panorama of that cove from a moving helicopter, we were told this next crater was a botanical garden with much different vegetation, if you can believe it. Zooming past that, we saw this lovely little lighthouse on a cliff edge that looked neat with the contrasting volcanic rock and blue watercolorsand circling that, we were able to see the Oahu-style sea-world equivalent that was featured in one of our family's favorite movies filmed on Oahu, 50 First Dates. Just past that was the house in the TV show Hawaii Five-O, and we also found out it was gifted to the Barack Obama family. ",
    "bmp-b2-21.jpg": "Shortly after I captured the 3 photo panorama of that cove from a moving helicopter, we were told this next crater was a botanical garden with much different vegetation, if you can believe it. Zooming past that, we saw this lovely little lighthouse on a cliff edge that looked neat with the contrasting volcanic rock and blue watercolorsand circling that, we were able to see the Oahu-style sea-world equivalent that was featured in one of our family's favorite movies filmed on Oahu, 50 First Dates. Just past that was the house in the TV show Hawaii Five-O, and we also found out it was gifted to the Barack Obama family. ",
    "bmp-b2-22.jpg": "After flying past many houses, I noticed less architecture and more lush green mountains. The first that caught my eye was this 3-peak one that the helicopter flew around until the peaks aligned like in this photograph. I was filming a video during this flight, too, and I love how this scene turned out on my video feed. You can find the video on my YouTube channel if you'd like to see the entire recording. After that, we were shown this road that tunnels straight through the island, and little did I realize we would drive through this later in our travels. The cliff edge in this photo, we were told, had historical events leading to these islands becoming known as the islands of Hawaii a long time ago. The story was dark, so explore it if you wish. Not long after that, we started flying over these large discs just below the ocean surface. I cannot remember what caused these to form, but they look beautiful. The following photograph I later learned is in a region of Oahu known as Kualoa Ranch, and my parents were gifted a dating adventure that traveled out to and over that artificial branch of land, spanning across the bottom right of the photo. According to locals, that mass of sand was laid there long ago.",
    "bmp-b2-23.jpg": "After flying past many houses, I noticed less architecture and more lush green mountains. The first that caught my eye was this 3-peak one that the helicopter flew around until the peaks aligned like in this photograph. I was filming a video during this flight, too, and I love how this scene turned out on my video feed. You can find the video on my YouTube channel if you'd like to see the entire recording. After that, we were shown this road that tunnels straight through the island, and little did I realize we would drive through this later in our travels. The cliff edge in this photo, we were told, had historical events leading to these islands becoming known as the islands of Hawaii a long time ago. The story was dark, so explore it if you wish. Not long after that, we started flying over these large discs just below the ocean surface. I cannot remember what caused these to form, but they look beautiful. The following photograph I later learned is in a region of Oahu known as Kualoa Ranch, and my parents were gifted a dating adventure that traveled out to and over that artificial branch of land, spanning across the bottom right of the photo. According to locals, that mass of sand was laid there long ago.",
    "bmp-b2-24.jpg": "After flying past many houses, I noticed less architecture and more lush green mountains. The first that caught my eye was this 3-peak one that the helicopter flew around until the peaks aligned like in this photograph. I was filming a video during this flight, too, and I love how this scene turned out on my video feed. You can find the video on my YouTube channel if you'd like to see the entire recording. After that, we were shown this road that tunnels straight through the island, and little did I realize we would drive through this later in our travels. The cliff edge in this photo, we were told, had historical events leading to these islands becoming known as the islands of Hawaii a long time ago. The story was dark, so explore it if you wish. Not long after that, we started flying over these large discs just below the ocean surface. I cannot remember what caused these to form, but they look beautiful. The following photograph I later learned is in a region of Oahu known as Kualoa Ranch, and my parents were gifted a dating adventure that traveled out to and over that artificial branch of land, spanning across the bottom right of the photo. According to locals, that mass of sand was laid there long ago.",
    "bmp-b2-25.jpg": "After flying past many houses, I noticed less architecture and more lush green mountains. The first that caught my eye was this 3-peak one that the helicopter flew around until the peaks aligned like in this photograph. I was filming a video during this flight, too, and I love how this scene turned out on my video feed. You can find the video on my YouTube channel if you'd like to see the entire recording. After that, we were shown this road that tunnels straight through the island, and little did I realize we would drive through this later in our travels. The cliff edge in this photo, we were told, had historical events leading to these islands becoming known as the islands of Hawaii a long time ago. The story was dark, so explore it if you wish. Not long after that, we started flying over these large discs just below the ocean surface. I cannot remember what caused these to form, but they look beautiful. The following photograph I later learned is in a region of Oahu known as Kualoa Ranch, and my parents were gifted a dating adventure that traveled out to and over that artificial branch of land, spanning across the bottom right of the photo. According to locals, that mass of sand was laid there long ago.",
    "bmp-b2-26.jpg": "After flying close to the shore, the pilot took us out over the ocean, where we got to see the Lizard Hat Island or, as it's known locally, Mokoli'i. You can see the land masses just under the ocean surface, which looks impeccable in this capture. After that, we flew through the Jurassic Valley, where many movies and TV shows were filmed in Oahu. It is part of Kualoa Ranch, and I will have more photos to share later in the book. What I loved about our helicopter flight was that the helicopter had a hula girl bobble figure on the instrumentation, and it would bounce around while I was sitting up front and bring a smile to my face when I saw it dancing. On the left of the valley was a beautiful mountain range, and on the right of the valley were land formations that were present in the Planet of the Apes movies. This valley is one of my favorite places I have had the pleasure of photographing.",
    "bmp-b2-27.jpg": "After flying close to the shore, the pilot took us out over the ocean, where we got to see the Lizard Hat Island or, as it's known locally, Mokoli'i. You can see the land masses just under the ocean surface, which looks impeccable in this capture. After that, we flew through the Jurassic Valley, where many movies and TV shows were filmed in Oahu. It is part of Kualoa Ranch, and I will have more photos to share later in the book. What I loved about our helicopter flight was that the helicopter had a hula girl bobble figure on the instrumentation, and it would bounce around while I was sitting up front and bring a smile to my face when I saw it dancing. On the left of the valley was a beautiful mountain range, and on the right of the valley were land formations that were present in the Planet of the Apes movies. This valley is one of my favorite places I have had the pleasure of photographing.",
    "bmp-b2-28.jpg": "After flying through the ranch, we continued along the coastline and saw this neat crystal blue cove. After that, we passed around a ridge line and approached what's known as Sacred Falls. We were told the only way to see Sacred Falls today is from a helicopter, and I was happy to see it in person. The top of the waterfall appeared to be starting just below the cloud cover that day. As we flew around, we enjoyed seeing the massively tall waterfall dropping several hundred feet across a few pools. It was breathtaking! After that highlight, we started flying back out of this area and towards the North Shore. Along the way were more green ridge lines. Seeing this much green complimenting the many shades of blue was so wonderful.",
    "bmp-b2-29.jpg": "After flying through the ranch, we continued along the coastline and saw this neat crystal blue cove. After that, we passed around a ridge line and approached what's known as Sacred Falls. We were told the only way to see Sacred Falls today is from a helicopter, and I was happy to see it in person. The top of the waterfall appeared to be starting just below the cloud cover that day. As we flew around, we enjoyed seeing the massively tall waterfall dropping several hundred feet across a few pools. It was breathtaking! After that highlight, we started flying back out of this area and towards the North Shore. Along the way were more green ridge lines. Seeing this much green complimenting the many shades of blue was so wonderful.",
    "bmp-b2-30.jpg": "After flying through the ranch, we continued along the coastline and saw this neat crystal blue cove. After that, we passed around a ridge line and approached what's known as Sacred Falls. We were told the only way to see Sacred Falls today is from a helicopter, and I was happy to see it in person. The top of the waterfall appeared to be starting just below the cloud cover that day. As we flew around, we enjoyed seeing the massively tall waterfall dropping several hundred feet across a few pools. It was breathtaking! After that highlight, we started flying back out of this area and towards the North Shore. Along the way were more green ridge lines. Seeing this much green complimenting the many shades of blue was so wonderful.",
    "bmp-b2-31.jpg": "After flying through the ranch, we continued along the coastline and saw this neat crystal blue cove. After that, we passed around a ridge line and approached what's known as Sacred Falls. We were told the only way to see Sacred Falls today is from a helicopter, and I was happy to see it in person. The top of the waterfall appeared to be starting just below the cloud cover that day. As we flew around, we enjoyed seeing the massively tall waterfall dropping several hundred feet across a few pools. It was breathtaking! After that highlight, we started flying back out of this area and towards the North Shore. Along the way were more green ridge lines. Seeing this much green complimenting the many shades of blue was so wonderful.",
    "bmp-b2-32.jpg": "After flying through the ranch, we continued along the coastline and saw this neat crystal blue cove. After that, we passed around a ridge line and approached what's known as Sacred Falls. We were told the only way to see Sacred Falls today is from a helicopter, and I was happy to see it in person. The top of the waterfall appeared to be starting just below the cloud cover that day. As we flew around, we enjoyed seeing the massively tall waterfall dropping several hundred feet across a few pools. It was breathtaking! After that highlight, we started flying back out of this area and towards the North Shore. Along the way were more green ridge lines. Seeing this much green complimenting the many shades of blue was so wonderful.",
    "bmp-b2-33.jpg": "As we were flying over the North Shore, the pilot pointed out that the mountain range in the distance, known locally as Wai'anae, somewhat resembles a resting pregnant woman. We quickly zoomed past a popular waterfall location where visitors can swim. As we flew by the Dole Plantation, I saw the beautiful maze I would later go through with my parents. I could sense that the helicopter tour was approaching its end; little did I know what we would hover around next.",
    "bmp-b2-34.jpg": "As we were flying over the North Shore, the pilot pointed out that the mountain range in the distance, known locally as Wai'anae, somewhat resembles a resting pregnant woman. We quickly zoomed past a popular waterfall location where visitors can swim. As we flew by the Dole Plantation, I saw the beautiful maze I would later go through with my parents. I could sense that the helicopter tour was approaching its end; little did I know what we would hover around next.",
    "bmp-b2-35.jpg": "As we were flying over the North Shore, the pilot pointed out that the mountain range in the distance, known locally as Wai'anae, somewhat resembles a resting pregnant woman. We quickly zoomed past a popular waterfall location where visitors can swim. As we flew by the Dole Plantation, I saw the beautiful maze I would later go through with my parents. I could sense that the helicopter tour was approaching its end; little did I know what we would hover around next.",
    "bmp-b2-36.jpg": "The following location we flew over was near Pearl Harbor, where we got to see the USS Arizona and the USS Missouri, which were great experiences I saw up close in person later in the trip. The last thing I captured while flying was the somewhat abandoned Hula Bowl Stadium being deconstructed. We would later enjoy the flea market in the stadium's parking lot. Overall, I was ecstatic with the beautiful flight I had, thanks to the talented and knowledgeable pilot of our flight! He was so helpful in informing us on what key destinations would be great to experience.",
    "bmp-b2-37.jpg": "The following location we flew over was near Pearl Harbor, where we got to see the USS Arizona and the USS Missouri, which were great experiences I saw up close in person later in the trip. The last thing I captured while flying was the somewhat abandoned Hula Bowl Stadium being deconstructed. We would later enjoy the flea market in the stadium's parking lot. Overall, I was ecstatic with the beautiful flight I had, thanks to the talented and knowledgeable pilot of our flight! He was so helpful in informing us on what key destinations would be great to experience.",
    "bmp-b2-38.jpg": "The following location we flew over was near Pearl Harbor, where we got to see the USS Arizona and the USS Missouri, which were great experiences I saw up close in person later in the trip. The last thing I captured while flying was the somewhat abandoned Hula Bowl Stadium being deconstructed. We would later enjoy the flea market in the stadium's parking lot. Overall, I was ecstatic with the beautiful flight I had, thanks to the talented and knowledgeable pilot of our flight! He was so helpful in informing us on what key destinations would be great to experience.",
    "bmp-b2-39.jpg": "We enjoyed one of the first sunsets when we were invited to the rest of the family's rental property with a fun patio and backyard. It had a cement balcony overlooking a volcanic rock edge with all sorts of crustaceans swimming around it, with the waves crashing each night. It was indeed a beautiful little area. We even saw many sea turtles swimming just off the shore. The following day, we wanted to visit the North Shore on the ground, and our first stop was a small shack known as the Sunrise Shack. The Acai Bowl I bought from them was delicious! Shortly after we ordered, it started to rain, and the rest of the family arrived. I got this fun picture of Rick enjoying his bowl under the shack's roof. We quickly returned to the beach in front of where we parked and enjoyed the crystal blue waters and beautiful sand. We noticed the waves were crashing roughly, making us hesitant to get in. When my brother and his wife asked me to get a picture of them, I snapped a series of photos leading up to a massive wave that crashed all around them. We spent several minutes laughing with joy at this photograph I was able to capture of them.",
    "bmp-b2-40.jpg": "We enjoyed one of the first sunsets when we were invited to the rest of the family's rental property with a fun patio and backyard. It had a cement balcony overlooking a volcanic rock edge with all sorts of crustaceans swimming around it, with the waves crashing each night. It was indeed a beautiful little area. We even saw many sea turtles swimming just off the shore. The following day, we wanted to visit the North Shore on the ground, and our first stop was a small shack known as the Sunrise Shack. The Acai Bowl I bought from them was delicious! Shortly after we ordered, it started to rain, and the rest of the family arrived. I got this fun picture of Rick enjoying his bowl under the shack's roof. We quickly returned to the beach in front of where we parked and enjoyed the crystal blue waters and beautiful sand. We noticed the waves were crashing roughly, making us hesitant to get in. When my brother and his wife asked me to get a picture of them, I snapped a series of photos leading up to a massive wave that crashed all around them. We spent several minutes laughing with joy at this photograph I was able to capture of them.",
    "bmp-b2-41.jpg": "We enjoyed one of the first sunsets when we were invited to the rest of the family's rental property with a fun patio and backyard. It had a cement balcony overlooking a volcanic rock edge with all sorts of crustaceans swimming around it, with the waves crashing each night. It was indeed a beautiful little area. We even saw many sea turtles swimming just off the shore. The following day, we wanted to visit the North Shore on the ground, and our first stop was a small shack known as the Sunrise Shack. The Acai Bowl I bought from them was delicious! Shortly after we ordered, it started to rain, and the rest of the family arrived. I got this fun picture of Rick enjoying his bowl under the shack's roof. We quickly returned to the beach in front of where we parked and enjoyed the crystal blue waters and beautiful sand. We noticed the waves were crashing roughly, making us hesitant to get in. When my brother and his wife asked me to get a picture of them, I snapped a series of photos leading up to a massive wave that crashed all around them. We spent several minutes laughing with joy at this photograph I was able to capture of them.",
    "bmp-b2-42.jpg": "We enjoyed one of the first sunsets when we were invited to the rest of the family's rental property with a fun patio and backyard. It had a cement balcony overlooking a volcanic rock edge with all sorts of crustaceans swimming around it, with the waves crashing each night. It was indeed a beautiful little area. We even saw many sea turtles swimming just off the shore. The following day, we wanted to visit the North Shore on the ground, and our first stop was a small shack known as the Sunrise Shack. The Acai Bowl I bought from them was delicious! Shortly after we ordered, it started to rain, and the rest of the family arrived. I got this fun picture of Rick enjoying his bowl under the shack's roof. We quickly returned to the beach in front of where we parked and enjoyed the crystal blue waters and beautiful sand. We noticed the waves were crashing roughly, making us hesitant to get in. When my brother and his wife asked me to get a picture of them, I snapped a series of photos leading up to a massive wave that crashed all around them. We spent several minutes laughing with joy at this photograph I was able to capture of them.",
    "bmp-b2-43.jpg": "What we noticed, however, was that the North Shore waves were a lot calmer the farther away from the shore you were. When I was younger, my mother photographed my father and me standing on the beach overlooking the Pacific Ocean, holding hands. It was one of my dad's favorite photos of us, and I always liked it a lot, too. It was an excellent memory to recreate. I also knew my phone was essentially waterproof, so I had a strap on it and took it out into the ocean where I was able to capture this cute photo of my parents where my mom looks like a mermaid swimming up to my dad, who is standing on the ocean floor. I thought capturing them in this wonderfully clear water was fun. I looked to my right and captured this photo of the water frozen in time with the white beaches and tropical trees being seen in the distance, the partly cloudy blue sky traveling away for almost an eternity. This is one of my favorite captures from this trip.",
    "bmp-b2-44.jpg": "We enjoyed one of the first sunsets when we were invited to the rest of the family's rental property with a fun patio and backyard. It had a cement balcony overlooking a volcanic rock edge with all sorts of crustaceans swimming around it, with the waves crashing each night. It was indeed a beautiful little area. We even saw many sea turtles swimming just off the shore. The following day, we wanted to visit the North Shore on the ground, and our first stop was a small shack known as the Sunrise Shack. The Acai Bowl I bought from them was delicious! Shortly after we ordered, it started to rain, and the rest of the family arrived. I got this fun picture of Rick enjoying his bowl under the shack's roof. We quickly returned to the beach in front of where we parked and enjoyed the crystal blue waters and beautiful sand. We noticed the waves were crashing roughly, making us hesitant to get in. When my brother and his wife asked me to get a picture of them, I snapped a series of photos leading up to a massive wave that crashed all around them. We spent several minutes laughing with joy at this photograph I was able to capture of them.",
    "bmp-b2-45.jpg": "What we noticed, however, was that the North Shore waves were a lot calmer the farther away from the shore you were. When I was younger, my mother photographed my father and me standing on the beach overlooking the Pacific Ocean, holding hands. It was one of my dad's favorite photos of us, and I always liked it a lot, too. It was an excellent memory to recreate. I also knew my phone was essentially waterproof, so I had a strap on it and took it out into the ocean where I was able to capture this cute photo of my parents where my mom looks like a mermaid swimming up to my dad, who is standing on the ocean floor. I thought capturing them in this wonderfully clear water was fun. I looked to my right and captured this photo of the water frozen in time with the white beaches and tropical trees being seen in the distance, the partly cloudy blue sky traveling away for almost an eternity. This is one of my favorite captures from this trip.",
    "bmp-b2-46.jpg": "What we noticed, however, was that the North Shore waves were a lot calmer the farther away from the shore you were. When I was younger, my mother photographed my father and me standing on the beach overlooking the Pacific Ocean, holding hands. It was one of my dad's favorite photos of us, and I always liked it a lot, too. It was an excellent memory to recreate. I also knew my phone was essentially waterproof, so I had a strap on it and took it out into the ocean where I was able to capture this cute photo of my parents where my mom looks like a mermaid swimming up to my dad, who is standing on the ocean floor. I thought capturing them in this wonderfully clear water was fun. I looked to my right and captured this photo of the water frozen in time with the white beaches and tropical trees being seen in the distance, the partly cloudy blue sky traveling away for almost an eternity. This is one of my favorite captures from this trip.",
    "bmp-b2-47.jpg": "Shortly after we enjoyed the beaches of the North Shore, my dad picked out a famous Shave Ice vendor known as Matsumoto, and it was a definite treat to experience. They have a small park outside their shop with plenty of places to enjoy this tasty treat. Next up on the trip was a store called The Ukulele Shop, where my mother and I picked out a couple of ukuleles and enjoyed seeing and hearing the many different options this store offered. We went back to our rental and started learning chords right away. I still need a lot more practice, but I am so glad I picked my ukulele from this shop on the North Shore.",
    "bmp-b2-48.jpg": "Shortly after we enjoyed the beaches of the North Shore, my dad picked out a famous Shave Ice vendor known as Matsumoto, and it was a definite treat to experience. They have a small park outside their shop with plenty of places to enjoy this tasty treat. Next up on the trip was a store called The Ukulele Shop, where my mother and I picked out a couple of ukuleles and enjoyed seeing and hearing the many different options this store offered. We went back to our rental and started learning chords right away. I still need a lot more practice, but I am so glad I picked my ukulele from this shop on the North Shore.",
    "bmp-b2-49.jpg": "The next day, we drove through a tunnel to reach Kualoa Ranch, and the first tour destination was a site of cultural significance. The four gods of Hawaii were carved into fine wood and shown on the side of the tour. The tour was in a large bus-style open-air buggy-type vehicle, where we could see many beautiful views of this area. We stopped at a few locations, too, including an area referred to as the snake pit from the recent Jumanji movie. We then reached a trailhead where we hiked up to see the beautiful Jurassic Valley, where many of the Jurassic Park movie scenes were filmed. I fell in love with this view; it was simply breathtaking.",
    "bmp-b2-50.jpg": "The next day, we drove through a tunnel to reach Kualoa Ranch, and the first tour destination was a site of cultural significance. The four gods of Hawaii were carved into fine wood and shown on the side of the tour. The tour was in a large bus-style open-air buggy-type vehicle, where we could see many beautiful views of this area. We stopped at a few locations, too, including an area referred to as the snake pit from the recent Jumanji movie. We then reached a trailhead where we hiked up to see the beautiful Jurassic Valley, where many of the Jurassic Park movie scenes were filmed. I fell in love with this view; it was simply breathtaking.",
    "bmp-b2-51.jpg": "The next day, we drove through a tunnel to reach Kualoa Ranch, and the first tour destination was a site of cultural significance. The four gods of Hawaii were carved into fine wood and shown on the side of the tour. The tour was in a large bus-style open-air buggy-type vehicle, where we could see many beautiful views of this area. We stopped at a few locations, too, including an area referred to as the snake pit from the recent Jumanji movie. We then reached a trailhead where we hiked up to see the beautiful Jurassic Valley, where many of the Jurassic Park movie scenes were filmed. I fell in love with this view; it was simply breathtaking.",
    "bmp-b2-52.jpg": "The next day, we drove through a tunnel to reach Kualoa Ranch, and the first tour destination was a site of cultural significance. The four gods of Hawaii were carved into fine wood and shown on the side of the tour. The tour was in a large bus-style open-air buggy-type vehicle, where we could see many beautiful views of this area. We stopped at a few locations, too, including an area referred to as the snake pit from the recent Jumanji movie. We then reached a trailhead where we hiked up to see the beautiful Jurassic Valley, where many of the Jurassic Park movie scenes were filmed. I fell in love with this view; it was simply breathtaking.",
    "bmp-b2-53.jpg": "Our tour guide got to show us some of the movie sets used for things like Kong and Jurassic World, including the Observation Deck, Velociraptor Cages, and the Gate of the Indominus Rex enclosure. What I loved seeing was just how quickly the natural vegetation took back over this area. Part of what makes Kualoa so neat is that its whole goal is maintaining and preserving the wild plants and animals of the Hawaiian Islands.",
    "bmp-b2-54.jpg": "Our tour guide got to show us some of the movie sets used for things like Kong and Jurassic World, including the Observation Deck, Velociraptor Cages, and the Gate of the Indominus Rex enclosure. What I loved seeing was just how quickly the natural vegetation took back over this area. Part of what makes Kualoa so neat is that its whole goal is maintaining and preserving the wild plants and animals of the Hawaiian Islands.",
    "bmp-b2-55.jpg": "Our tour guide got to show us some of the movie sets used for things like Kong and Jurassic World, including the Observation Deck, Velociraptor Cages, and the Gate of the Indominus Rex enclosure. What I loved seeing was just how quickly the natural vegetation took back over this area. Part of what makes Kualoa so neat is that its whole goal is maintaining and preserving the wild plants and animals of the Hawaiian Islands.",
    "bmp-b2-56.jpg": "Our tour guide got to show us some of the movie sets used for things like Kong and Jurassic World, including the Observation Deck, Velociraptor Cages, and the Gate of the Indominus Rex enclosure. What I loved seeing was just how quickly the natural vegetation took back over this area. Part of what makes Kualoa so neat is that its whole goal is maintaining and preserving the wild plants and animals of the Hawaiian Islands.",
    "bmp-b2-57.jpg": "I wanted to capture some Milky Way photos that night, so I quickly set up my tripod at the back of the rental property and captured this photo of the Milky Way high above the crashing ocean waves. I do like how this photograph turned out. The next day, we witnessed the USS Arizona Memorial. We could see the immaculate monument built to remember the many lives lost during WWII, especially during the Pearl Harbor Attacks. It was interesting and somewhat heartbreaking to hear in great detail how the attacks transpired. In one of my photos, oil floats to the surface just outside the memorial. In another photograph, you can see one of the stacks of the Arizona in the clear blue waters. It was immaculate to experience this memorial, and I am very thankful for everyone who serves our country to protect the freedoms we often take for granted. These freedoms have a cost and weight, and I am incredibly grateful to everyone who serves.",
    "bmp-b2-58.jpg": "I wanted to capture some Milky Way photos that night, so I quickly set up my tripod at the back of the rental property and captured this photo of the Milky Way high above the crashing ocean waves. I do like how this photograph turned out. The next day, we witnessed the USS Arizona Memorial. We could see the immaculate monument built to remember the many lives lost during WWII, especially during the Pearl Harbor Attacks. It was interesting and somewhat heartbreaking to hear in great detail how the attacks transpired. In one of my photos, oil floats to the surface just outside the memorial. In another photograph, you can see one of the stacks of the Arizona in the clear blue waters. It was immaculate to experience this memorial, and I am very thankful for everyone who serves our country to protect the freedoms we often take for granted. These freedoms have a cost and weight, and I am incredibly grateful to everyone who serves.",
    "bmp-b2-59.jpg": "I wanted to capture some Milky Way photos that night, so I quickly set up my tripod at the back of the rental property and captured this photo of the Milky Way high above the crashing ocean waves. I do like how this photograph turned out. The next day, we witnessed the USS Arizona Memorial. We could see the immaculate monument built to remember the many lives lost during WWII, especially during the Pearl Harbor Attacks. It was interesting and somewhat heartbreaking to hear in great detail how the attacks transpired. In one of my photos, oil floats to the surface just outside the memorial. In another photograph, you can see one of the stacks of the Arizona in the clear blue waters. It was immaculate to experience this memorial, and I am very thankful for everyone who serves our country to protect the freedoms we often take for granted. These freedoms have a cost and weight, and I am incredibly grateful to everyone who serves.",
    "bmp-b2-60.jpg": "After experiencing the USS Arizona Memorial, we then drove over to the USS Missouri, which I later learned was around when the United States first became involved in WWII and was also used to end Japan's involvement in WWII out of the bay of Tokyo. One of my photographs shows the landmark placed on the ship where the articles of surrender were signed in that bay. I also liked seeing the Harlem Globe Trotters basketball hoop on deck and the many different old computers, including several Apple Macintoshes that were used to train crew on how to use computers long ago. I also captured some fun photos of Adrian posing with a large machine gun, and they caught a delightful photograph of me in front of the six massive artillery cannons aboard the ship. I was delighted I could join them in exploring the USS Missouri. ",
    "bmp-b2-61.jpg": "After experiencing the USS Arizona Memorial, we then drove over to the USS Missouri, which I later learned was around when the United States first became involved in WWII and was also used to end Japan's involvement in WWII out of the bay of Tokyo. One of my photographs shows the landmark placed on the ship where the articles of surrender were signed in that bay. I also liked seeing the Harlem Globe Trotters basketball hoop on deck and the many different old computers, including several Apple Macintoshes that were used to train crew on how to use computers long ago. I also captured some fun photos of Adrian posing with a large machine gun, and they caught a delightful photograph of me in front of the six massive artillery cannons aboard the ship. I was delighted I could join them in exploring the USS Missouri. ",
    "bmp-b2-62.jpg": "I wanted to capture some Milky Way photos that night, so I quickly set up my tripod at the back of the rental property and captured this photo of the Milky Way high above the crashing ocean waves. I do like how this photograph turned out. The next day, we witnessed the USS Arizona Memorial. We could see the immaculate monument built to remember the many lives lost during WWII, especially during the Pearl Harbor Attacks. It was interesting and somewhat heartbreaking to hear in great detail how the attacks transpired. In one of my photos, oil floats to the surface just outside the memorial. In another photograph, you can see one of the stacks of the Arizona in the clear blue waters. It was immaculate to experience this memorial, and I am very thankful for everyone who serves our country to protect the freedoms we often take for granted. These freedoms have a cost and weight, and I am incredibly grateful to everyone who serves.",
    "bmp-b2-63.jpg": "After experiencing the USS Arizona Memorial, we then drove over to the USS Missouri, which I later learned was around when the United States first became involved in WWII and was also used to end Japan's involvement in WWII out of the bay of Tokyo. One of my photographs shows the landmark placed on the ship where the articles of surrender were signed in that bay. I also liked seeing the Harlem Globe Trotters basketball hoop on deck and the many different old computers, including several Apple Macintoshes that were used to train crew on how to use computers long ago. I also captured some fun photos of Adrian posing with a large machine gun, and they caught a delightful photograph of me in front of the six massive artillery cannons aboard the ship. I was delighted I could join them in exploring the USS Missouri. ",
    "bmp-b2-64.jpg": "After experiencing the USS Arizona Memorial, we then drove over to the USS Missouri, which I later learned was around when the United States first became involved in WWII and was also used to end Japan's involvement in WWII out of the bay of Tokyo. One of my photographs shows the landmark placed on the ship where the articles of surrender were signed in that bay. I also liked seeing the Harlem Globe Trotters basketball hoop on deck and the many different old computers, including several Apple Macintoshes that were used to train crew on how to use computers long ago. I also captured some fun photos of Adrian posing with a large machine gun, and they caught a delightful photograph of me in front of the six massive artillery cannons aboard the ship. I was delighted I could join them in exploring the USS Missouri. ",
    "bmp-b2-65.jpg": "After experiencing the USS Arizona Memorial, we then drove over to the USS Missouri, which I later learned was around when the United States first became involved in WWII and was also used to end Japan's involvement in WWII out of the bay of Tokyo. One of my photographs shows the landmark placed on the ship where the articles of surrender were signed in that bay. I also liked seeing the Harlem Globe Trotters basketball hoop on deck and the many different old computers, including several Apple Macintoshes that were used to train crew on how to use computers long ago. I also captured some fun photos of Adrian posing with a large machine gun, and they caught a delightful photograph of me in front of the six massive artillery cannons aboard the ship. I was delighted I could join them in exploring the USS Missouri. ",
    "bmp-b2-66.jpg": "That night, I had the pleasure of setting up some astrophotography gear at the other rental property and captured this beautiful photo of the Milky Way with a palm tree in view. The next day, we drove to the Dole plantation, and I grabbed some fun pictures in the garden. The first I want to share is of a Gecko that looked so neat. I don't think I had seen geckos look like that outside of a Geico Commercial, so seeing this wild one was a sight to see. After that, I captured this photo of a Hibiscus flower. I love hibiscus tea, so seeing this flower so close was simply beautiful. The last image from the Dole plantation is one I captured of the rather red soil that makes Dole pineapple taste so very good. I loved how red the earth was in many areas of Oahu. It was indeed unique.",
    "bmp-b2-67.jpg": "That night, I had the pleasure of setting up some astrophotography gear at the other rental property and captured this beautiful photo of the Milky Way with a palm tree in view. The next day, we drove to the Dole plantation, and I grabbed some fun pictures in the garden. The first I want to share is of a Gecko that looked so neat. I don't think I had seen geckos look like that outside of a Geico Commercial, so seeing this wild one was a sight to see. After that, I captured this photo of a Hibiscus flower. I love hibiscus tea, so seeing this flower so close was simply beautiful. The last image from the Dole plantation is one I captured of the rather red soil that makes Dole pineapple taste so very good. I loved how red the earth was in many areas of Oahu. It was indeed unique.",
    "bmp-b2-68.jpg": "That night, I had the pleasure of setting up some astrophotography gear at the other rental property and captured this beautiful photo of the Milky Way with a palm tree in view. The next day, we drove to the Dole plantation, and I grabbed some fun pictures in the garden. The first I want to share is of a Gecko that looked so neat. I don't think I had seen geckos look like that outside of a Geico Commercial, so seeing this wild one was a sight to see. After that, I captured this photo of a Hibiscus flower. I love hibiscus tea, so seeing this flower so close was simply beautiful. The last image from the Dole plantation is one I captured of the rather red soil that makes Dole pineapple taste so very good. I loved how red the earth was in many areas of Oahu. It was indeed unique.",
    "bmp-b2-69.jpg": "That night, I had the pleasure of setting up some astrophotography gear at the other rental property and captured this beautiful photo of the Milky Way with a palm tree in view. The next day, we drove to the Dole plantation, and I grabbed some fun pictures in the garden. The first I want to share is of a Gecko that looked so neat. I don't think I had seen geckos look like that outside of a Geico Commercial, so seeing this wild one was a sight to see. After that, I captured this photo of a Hibiscus flower. I love hibiscus tea, so seeing this flower so close was simply beautiful. The last image from the Dole plantation is one I captured of the rather red soil that makes Dole pineapple taste so very good. I loved how red the earth was in many areas of Oahu. It was indeed unique.",
    "bmp-b2-70.jpg": "Toward the end of our trip, we went to a rather lovely Luau, where we saw a traditional ceremonial feast and a concert. It was on the coast, and I captured a few airbuses landing at the nearby airport. The next day, we went hiking to a couple of pillboxes that were all graffitied up. This trail was incredibly steep and had some breathtaking views. I photographed my mother on a volcanic cliff edge, and it looked so neat. I loved the two islands in the distance with the relatively calm skies for that day. At the end of that day, my mother and I drove to the island's east side to capture some sunset photographs, where I captured this peaceful scene. There was a park that we walked past to get to the shoreline, and overall, it was pretty calm and very relaxing.",
    "bmp-b2-71.jpg": "Toward the end of our trip, we went to a rather lovely Luau, where we saw a traditional ceremonial feast and a concert. It was on the coast, and I captured a few airbuses landing at the nearby airport. The next day, we went hiking to a couple of pillboxes that were all graffitied up. This trail was incredibly steep and had some breathtaking views. I photographed my mother on a volcanic cliff edge, and it looked so neat. I loved the two islands in the distance with the relatively calm skies for that day. At the end of that day, my mother and I drove to the island's east side to capture some sunset photographs, where I captured this peaceful scene. There was a park that we walked past to get to the shoreline, and overall, it was pretty calm and very relaxing.",
    "bmp-b2-72.jpg": "Toward the end of our trip, we went to a rather lovely Luau, where we saw a traditional ceremonial feast and a concert. It was on the coast, and I captured a few airbuses landing at the nearby airport. The next day, we went hiking to a couple of pillboxes that were all graffitied up. This trail was incredibly steep and had some breathtaking views. I photographed my mother on a volcanic cliff edge, and it looked so neat. I loved the two islands in the distance with the relatively calm skies for that day. At the end of that day, my mother and I drove to the island's east side to capture some sunset photographs, where I captured this peaceful scene. There was a park that we walked past to get to the shoreline, and overall, it was pretty calm and very relaxing.",
    "bmp-b2-73.jpg": "Toward the end of our trip, we went to a rather lovely Luau, where we saw a traditional ceremonial feast and a concert. It was on the coast, and I captured a few airbuses landing at the nearby airport. The next day, we went hiking to a couple of pillboxes that were all graffitied up. This trail was incredibly steep and had some breathtaking views. I photographed my mother on a volcanic cliff edge, and it looked so neat. I loved the two islands in the distance with the relatively calm skies for that day. At the end of that day, my mother and I drove to the island's east side to capture some sunset photographs, where I captured this peaceful scene. There was a park that we walked past to get to the shoreline, and overall, it was pretty calm and very relaxing.",
    "bmp-b2-74.jpg": "That pillbox hike was not enough for us; we wanted more, so we hiked to the top of Diamond Head to capture this beautiful photo of Waikiki. The hike was exciting and included a steep walk through a dark tunnel half the length of a football field. It was a neat experience, and I also noticed a helicopter pad near the top. After getting down the trail, we drove to the Halona Blowhole, which was also interesting. I honestly don't think I had seen one like this before, and it is one of only three naturally formed blowholes in the world I heard. After that adventure, we spent the remaining few hours preparing for safe travels back home; our experience was over. We needed to prepare to re-enter our everyday lives.",
    "bmp-b2-75.jpg": "That pillbox hike was not enough for us; we wanted more, so we hiked to the top of Diamond Head to capture this beautiful photo of Waikiki. The hike was exciting and included a steep walk through a dark tunnel half the length of a football field. It was a neat experience, and I also noticed a helicopter pad near the top. After getting down the trail, we drove to the Halona Blowhole, which was also interesting. I honestly don't think I had seen one like this before, and it is one of only three naturally formed blowholes in the world I heard. After that adventure, we spent the remaining few hours preparing for safe travels back home; our experience was over. We needed to prepare to re-enter our everyday lives.",
    "bmp-b2-76.jpg": "Shortly after we arrived home, my dad went to work at his new job up in the mountains and invited us to the trailer for some adventures in our favorite local forest. I, of course, took my dog, Luma, and explored some of our favorite locations. My mother and I went hiking to our favorite campgrounds, and Luma was glowing in front of these wildflowers. Back home, I could capture this relaxed photograph of my dog in our backyard. Life was starting to calm down after the recent excitements.",
    "bmp-b2-77.jpg": "Shortly after we arrived home, my dad went to work at his new job up in the mountains and invited us to the trailer for some adventures in our favorite local forest. I, of course, took my dog, Luma, and explored some of our favorite locations. My mother and I went hiking to our favorite campgrounds, and Luma was glowing in front of these wildflowers. Back home, I could capture this relaxed photograph of my dog in our backyard. Life was starting to calm down after the recent excitements.",
    "bmp-b2-78.jpg": "Shortly after we arrived home, my dad went to work at his new job up in the mountains and invited us to the trailer for some adventures in our favorite local forest. I, of course, took my dog, Luma, and explored some of our favorite locations. My mother and I went hiking to our favorite campgrounds, and Luma was glowing in front of these wildflowers. Back home, I could capture this relaxed photograph of my dog in our backyard. Life was starting to calm down after the recent excitements.",
    "bmp-b2-79.jpg": "It had been a couple of months, and I wanted to go on another adventure with my family before the summer was over, so with Memorial Day being an observed holiday, we traveled back up to the mountains with my father again. When we arrived, we noticed that the clouds were low in the sky and were obscuring the tops of the Sequoias nearby. I like seeing clouds that low, and I find it pretty to photograph some more gloomy weather sometimes. We went for a hike so my dad could enjoy some fishing, and while we were fishing downriver, I caught this photograph of my father smiling atop a rock. My parents had a great time fishing together. I always love exploring with my family. I am very thankful for my many adventures this year, and I never know what the future will bring! I do know I can enjoy the present now.",
    "bmp-b2-80.jpg": "It had been a couple of months, and I wanted to go on another adventure with my family before the summer was over, so with Memorial Day being an observed holiday, we traveled back up to the mountains with my father again. When we arrived, we noticed that the clouds were low in the sky and were obscuring the tops of the Sequoias nearby. I like seeing clouds that low, and I find it pretty to photograph some more gloomy weather sometimes. We went for a hike so my dad could enjoy some fishing, and while we were fishing downriver, I caught this photograph of my father smiling atop a rock. My parents had a great time fishing together. I always love exploring with my family. I am very thankful for my many adventures this year, and I never know what the future will bring! I do know I can enjoy the present now."
}